[{"date":"2020-01-01","name":"Uudenvuodenpäivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Uudenvuodenp%C3%A4iv%C3%A4","description":"Uusivuosi on juhla, jolla juhlistetaan vuoden vaihtumista, kun vanhan vuoden viimeinen päivä (uudenvuodenaatto) vaihtuu uuden vuoden ensimmäiseksi päiväksi (uudenvuodenpäivä). Uuttavuotta juhlitaan ympäri maailmaa eri tavoin. Uuden vuoden alkaessa on tapana muistella menneen vuoden tapahtumia sekä tehdä suunnitelmia alkavan vuoden varalle."},{"date":"2020-01-06","name":"Loppiainen","alternate_names":"Epifania; Teofania","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0017","description":"Loppiainen on kristillinen juhlapäivä, joka päättää joulun pyhät. Sitä nimitetään myös Jumalan ilmestymisen juhlaksi, ja se on todennäköisesti joulua vanhempi kristillinen juhla. Vaikka loppiainen suomen kielessä viittaa nimelläänkin jouluajan loppumiseen, suomalaisessa kansanperinteessä joulunajan on kuitenkin yleisesti katsottu jatkuvan sen jälkeenkin Nuutin päivään saakka.\n\nKatolisessa ja luterilaisessa kirkossa loppiaista vietetään itämaan tietäjien Betlehemiin saapumisen muistopäivänä. Monissa maissa sitä nimitetäänkin kolmen kuninkaan juhlaksi. Se on omistettu myös lähetystyölle."},{"date":"2020-02-02","name":"Kynttilänpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0088","description":"Kynttilänpäivä (kynttilämessu, ortodokseilla Herran temppeliintuominen) on kristillinen juhlapäivä, jota vietetään alkujaan 40 päivää joulusta sen muistoksi, että Jeesus vietiin 40 päivän ikäisenä temppeliin ja Simeon siunasi hänet.\n\nTapahtuman taustalla on kertomus vapautumisesta Egyptin orjuudesta ja juutalainen pääsiäinen. Sen mukaan jokainen esikoinen kuuluu Jumalalle, ja hänet lunastetaan Jumalalta. Taustalla ovat myös synnyttämiseen kuuluvat puhtaussäännökset."},{"date":"2020-02-23","name":"Laskiaissunnuntai","alternate_names":"Esto mihi; Quinquagesima; sovintosunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0026","description":"Laskiainen on katolisen kirkon kirkon kevätpaaston alkajaisjuhla. Suomessa sanaa käytetään nykyisin laskiaistiistaista.\n\nLaskiaista vietetään seitsemän viikkoa ennen pääsiäistä. Siihen kuuluvia juhlapäiviä ovat laskiaissunnuntai sekä kaksi päivää myöhemmin oleva laskiaistiistai, useissa maissa myös niiden välinen maanantai, joka esimerkiksi Saksassa tunnetaan nimellä Rosenmontag (\"ruusumaanantai\"). Laskiaisen jälkeen alka paastonaika, joka loppuu vasta pääsiäisenä. Oleellista paastonajalle oli liharuokien pois jättäminen ruokavaliosta, johon myös useat laskiaiseen liittyvät termit viittaavat. Laskiaistiistain jälkeinen tuhkakeskiviikko aloittaa 40 päivää kestävä paastoamisen."},{"date":"2020-03-22","name":"Marian ilmestyspäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0089","description":"Marian ilmestyspäivä eli marianpäivä on kristillinen juhlapäivä, joka juhlistaa arkkienkeli Gabrielin ilmestymistä Neitsyt Marialle ilmoittamaan Kristuksen tulevasta syntymästä. Tapauksesta kerrotaan Luukkaan evankeliumin ensimmäisessä luvussa.\n\nMarian ilmestyspäivän liturginen väri on valkoinen, Marian ilmestyspäivää edeltävän viikon värinä on sininen tai violetti."},{"date":"2020-04-05","name":"Palmusunnuntai","alternate_names":"virposunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0033","description":"Palmusunnuntai on kristillisen kirkkovuoden juhla, joka on viikkoa ennen pääsiäissunnuntaita. Palmusunnuntai aloittaa niin sanotun hiljaisen viikon, jolloin muistellaan Jeesuksen kärsimyksiä.\n\nPalmusunnuntaita vietetään sen tapauksen muistoksi, kun Jeesus saapui aasilla ratsastaen Jerusalemiin. Tapauksesta kerrotaan kaikissa evankeliumeissa. Palmusunnuntai on saanut nimensä palmunlehvistä, joita kansa levitti vaatteiden ohella Jeesuksen eteen. Ihmiset huusivat ja lauloivat \"Hoosianna\". Hoosianna on suoraan käännettynä \"oi, auta\", \"oi, pelasta\", mutta ajanlaskun alun aikoihin sitä käytettiin riemuhuutona.\n\nPohjoisessa ainoa elävä oksa pääsiäisen aikaan on paju, ja päivä tunnetaan myös virpa- tai virpomasunnuntain nimellä. Vanhastaan Karjalassa, nykyisin yleisesti koko Suomessa päivän perinteisiin kuuluu virpominen."},{"date":"2020-04-10","name":"Pitkäperjantai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0038","description":"Pitkäperjantai on pääsiäistä edeltävä perjantai. Se on Kristuksen ristiinnaulitsemis- ja kuolinpäivä ja kirkkovuoden ainoa surujuhla. Pitkäperjantai on yksi Suuren viikon juhlapyhistä.\n\nLuterilaisessa kirkossa pitkänperjantain jumalanpalvelusta vietetään ilman ehtoollista ja kellon- ja urkujensoittoa. Kello 15 voidaan viettää Jeesuksen kuolinhetken muistoa. Pitkänperjantain iltajumalanpalvelus taas on perinteisesti omistettu Jeesuksen hautaamiselle. Pitkäperjantai ja hiljainen lauantai ovat ainoat kirkkovuoden päivät, jolloin liturginen väri on musta."},{"date":"2020-04-12","name":"Pääsiäissunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0043","description":"Pääsiäinen on kristinuskon vuotuisjuhla, jota vietetään Jeesuksen ylösnousemuksen juhlana. Ylösnousemus on kristillisen uskon ydinkohtia, ja pääsiäinen kirkkovuoden vanhin ja tärkein juhla. Pääsiäistä edeltää hiljainen viikko, joka huipentuu pitkäperjantaihin, Jeesuksen ristiinnaulitsemisen päivään.\n\nPääsiäiseen liittyy useita keväisen luonnon heräävän elämän vertauskuvia. Näitä ovat muun muassa narsissit, rairuoho, keltaiset pääsiäistiput sekä kanit eli puput. Uutta elämää kuvaavat myös hiirenkorvalle puhkeavat koivunoksat ja pajunkissat. Muna on eri puolilla maailmaa tunnettu hedelmällisyyden ja kasvun vertauskuva."},{"date":"2020-04-13","name":"Toinen pääsiäispäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0044","description":"Toinen pääsiäispäivä on pääsiäispäivää seuraava maanantai. Päivänä muistetaan ylösnousseen Jeesuksen ilmestymistä opetuslapsille ja muutamille naisille. Ilmestykset vakuuttivat heidät hänen kuolleista nousemisestaan ja jatkuvasta läsnäolostaan. Teemana \"seurakunta elää Ylösnousseen seurassa\"."},{"date":"2020-05-01","name":"Vappu","flag_day":1,"alternate_names":"suomalaisen työn päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Vappu","description":"Vappu on kansainvälinen juhlapäivä ja monissa maissa yleinen vapaapäivä. Se on alkavan kevään juhlapäivä sekä kansainvälinen työväen juhlapäivä. Suomessa vapunpäivää aattopäivineen vietetään työväen, ylioppilaiden ja kevään karnevaalijuhlana. Vuodesta 1979 lähtien vappu on ollut Suomessa virallinen liputuspäivä, suomalaisen työn päivä.\n\nNimi vappu tulee 700-luvulla eläneestä baijerilaisesta abbedissa Valburgista. Vappua on juhlittu keskiajalta lähtien - myös Suomessa - 1. toukokuuta, joka on Valburgin pyhimykseksi julistamisen päivä. Sen mukaisesti päivä on myös Vapun ja Valpurin nimipäivä. Nykyään päivä ei ole kirkollinen juhlapäivä, vaikka onkin yleinen vapaapäivä, mutta aikoinaan samaksi päiväksi sattui myös apostolien Filippuksen ja Jaakobin muistopäivä."},{"date":"2020-05-17","name":"Kaatuneiden muistopäivä","flag_day":1,"age":80,"url":"https:\/\/fi.wikipedia.org\/wiki\/Kaatuneiden_muistop%C3%A4iv%C3%A4","description":"Kaatuneiden muistopäivä on sodassa kaatuneiden vainajien muistoksi järjestetty päivä. Järjestelyihin kuuluu valtakunnallinen pääjuhla, paikallisia muistotilaisuuksia jumalanpalveluksineen ja sankarihaudoilla käynteineen. Nykyisin muistopäivänä kunnioitetaan itsenäisen Suomen kaikkien sotien kaikkia vainajia."},{"date":"2020-05-21","name":"Helatorstai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0055","description":"Helatorstai on vuotuinen kristillinen juhla, jota vietetään neljäntenäkymmenentenä päivänä pääsiäisestä Jeesuksen taivaaseenastumisen muistoksi.\n\nUseimmissa kielissä päivän nimi viittaa suoraan juhlan aiheeseen, Kristuksen taivaaseenastumiseen. Suomen kielessä sillä on kuitenkin perinteinen, alkujaan ruotsista lainattu nimi, jonka alkuosa hela viittaa ruotsin kielen pyhää tarkoittavaan sanaan helg."},{"date":"2020-05-31","name":"Helluntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0058","description":"Helluntai on Pyhän Hengen vuodattamiselle omistettu kristillinen juhlapäivä. Helluntaita vietetään seitsemän viikon kuluttua pääsiäisestä ja kymmenen päivää helatorstain jälkeen. Suomen kieleen sana helluntai on tullut ruotsin kielen sanoista helig dag, pyhä päivä.\n\nAlkuperältään ja ajankohdaltaan helluntai liittyy myös juutalaisten shavuot-juhlaan eli viikkojuhlaan, jota vietetään seitsemän viikkoa juutalaisten pääsiäisen eli pesahin jälkeen toisaalta sadonkorjuu­juhlana, toisaalta Siinailla tapahtuneen lain antamisen muisto­juhlana.\n\nSuomessa helluntai on kirkkolain mukainen kirkollinen juhlapäivä. Kaupat pidetään silloin eräin poikkeuksin laki­sääteisesti kiinni."},{"date":"2020-06-07","name":"Pyhän Kolminaisuuden päivä","alternate_names":"1. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0060","description":"Pyhän Kolminaisuuden päivä on kristillinen juhlapäivä, jota vietetään ensimmäisenä sunnuntaina helluntain jälkeen. Sen vietto sai alkunsa Englannissa 1000-luvulla. Päivä on omistettu Pyhälle Kolminaisuudelle. Pyhän kolminaisuuden päivän liturginen väri on valkoinen."},{"date":"2020-06-20","name":"Juhannus","flag_day":1,"alternate_names":"Johannes Kastajan päivä; Suomen lipun päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Juhannus","description":"Juhannus on suomalainen nimi keskikesän juhlalle, jota vietetään kesäkuussa kesäpäivänseisauksen lähellä. Pohjoisessa juhannus on valon juhla, jolloin keskikesä on kauneimmillaan.\n\nSuomalaiseen juhannukseen kuuluvat kiinteästi juhannussauna, juhannuskokko, juhannustanssit ja muut juhlat. Suomessa juhannus on myös virallinen liputuspäivä, jolloin liputetaan koko juhannusyön ajan. Monet juhannuksen perinteistä juontavat juurensa vanhaan eurooppalaiseen valon ja hedelmällisyyden juhlaan kesäpäivänseisauksen aikana.\n\nSuomessa ja Ruotsissa juhannus on ollut tärkeä kansanomainen merkkipäivä. Juhannukseen on vanhastaan liittynyt erilaisia uskomuksia ja taikoja, joilla on pyritty varmistamaan tuleva sato ja naimaonni. Monet kristilliset kirkkokunnat viettävät juhannusta Johannes Kastajan muistopäivänä, mistä tulee nimi juhannus.\n\nJuhannus on virallinen liputuspäivä, Suomen lipun päivä. Muista liputuspäivistä poiketen silloin liputus alkaa jo aattoiltana kello 18 ja jatkuu yön yli yhtäjaksoisesti juhannuspäivän iltaan kello 21 saakka."},{"date":"2020-07-12","name":"Apostolien päivä","alternate_names":"6. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0065","description":"Apostolien päivää on vietetty Pietarin ja Paavalin marttyyrikuolemiensa muistoksi Keskiajalla, mutta nykyään Apostolien päivänä muistellaan kaikki apostoleja. Liturginen väri on punainen ja alttarikynttilöitä on neljä."},{"date":"2020-07-26","name":"Kirkastussunnuntai","alternate_names":"8. sunnuntai helluntaista; Kristuksen kirkastumisen päivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0067","description":"Kirkastussunnuntai on Suomen evankelis-luterilaisen kirkon kirkkovuodessa nimitys seitsemännelle kolminaisuudenpäivän jälkeiselle sunnuntaille eli kahdeksannelle sunnuntaille helluntaista. Päivää vietetään Kristuksen kirkastumisen muistoksi."},{"date":"2020-10-04","name":"Mikkelinpäivä","alternate_names":"Enkelien sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0091","description":"Mikkelinpäivä on alun perin arkkienkeli Mikaelin, mutta nykyisin päivä on omistettu kaikille enkeleille."},{"date":"2020-10-31","name":"Pyhäinpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0092","description":"Pyhäinpäivä on kristillinen pyhimysten, marttyyrien ja vainajien muistopäivä\n\nNykyinen suomalainen pyhäinpäivä on yhdistelmä kahdesta varsinkin katolisen kirkon keskiajalta lähtien viettämästä juhlasta, jotka ovat kaikkien pyhien päivä 1. marraskuuta ja kaikkien uskovien vainajien muistopäivä 2. marraskuuta. Suomessa siitä on tullut yleinen vainajien muistopäivä. Silloin monet vievät läheisten haudalle esimerkiksi kynttilän tai kukkia kuolleiden muistoksi. Kotona voidaan myös sytyttää kynttilä läheisen muistoksi.\n\nVanhoista ajoista on Suomessa vietetty syksyllä sadonkorjuun päättymisen jälkeen kekriä. Koska se ajankohdaltaan sattui lähelle kristillistä pyhäinpäivää, se on myöhempinä aikoina usein samastettukin pyhäinpäivän kanssa, josta kansanomaisesti onkin käytetty myös nimitystä kekri."},{"date":"2020-11-22","name":"Tuomiosunnuntai","alternate_names":"Kristuksen kuninkuuden sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0087","description":"Tuomiosunnuntai kirkkovuoden viimeinen sunnuntai. Sen nimi vaihtelee eri kirkkokunnissa, Suomessa se on Ruotsin mallin mukaan 'tuomiosunnuntai'. Tuomiosunnuntain liturginen väri on vihreä.\n\nTuomiosunnuntain sanoma liittyy Kristuksen toiseen tulemukseen, nyt kuninkaana ja vanhurskaana tuomarina."},{"date":"2020-12-06","name":"Suomen itsenäisyyspäivä","flag_day":1,"age":103,"url":"https:\/\/fi.wikipedia.org\/wiki\/Suomen_itsen%C3%A4isyysp%C3%A4iv%C3%A4","description":"Suomen itsenäisyyspäivä on Suomen kansallispäivä, jota vietetään 6. joulukuuta 1917 tapahtuneen itsenäistymisen kunniaksi. Itsenäisen Suomea edelsi Suomen suuriruhtinaskunta, joka oli itsehallinnollinen osa Venäjän keisarikuntaa.\n\nJoulukuun 6. päivää on vietetty itsenäisyyspäivänä vuodesta 1919 lähtien. Asiasta päätti Valtioneuvosto, ja päivästä tuli vapaapäivä valtion virastoissa, kouluissa ja tuomioistuimissa. Vuonna 1929 säädettiin lailla yleiseksi palkalliseksi vapaapäiväksi. Vuonna 1937 säädettiin laki itsenäisyyspäivän viettämisestä yleisenä juhla- ja vapaapäivänä. Sen mukaan päivä itsenäisyyspäivän tuli olla palkallinen vapaapäivä, tai missä se ei ole mahdollista, on maksettava korotettua palkkaa kuten sunnuntaityöstä.\n\nItsenäisyyspäivä on myös virallinen liputuspäivä. Silloin liputus päättyy muista liputuspäivistä poikkeavasti klo 20."},{"date":"2020-12-25","name":"Joulupäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0009","description":"Joulua vietetään Jeesuksen syntymän muistoksi. Joulun vietto alkaa Suomessa yleensä jo aattoiltana, joulukuun 25. päivä on kuitenkin varsinainen joulupäivä.\n\nJoulun ajankohta on muinaisen roomalaisen kalenterin talvipäivänseisauksen päivämäärä. Suomen kielen sana joulu ja juhla ovat ruotsalaisia tai skandinaavisia lainasanoja. Sana joulu tulee alun perin ennen kristinuskoa vietetyn talvipäivänseisauksen juhlan muinaisgermaanisesta nimestä. Joulussa ovat yhdistyneet kristillinen juhla, muinainen roomalainen saturnalia-juhla sekä Euroopan pohjoisten kansojen maatalousvuoden päättäjäis- ja keskitalven juhla (yule), Suomessa vanha vuodenvaihteenjuhla kekri. Joulu on yleinen perhejuhla eri puolilla maailmaa."},{"date":"2020-12-26","name":"Tapaninpäivä","alternate_names":"2. joulupäivä; marttyyri Stefanoksen ja kaikkien marttyyrien muistopäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0010","description":"Tapaninpäivä eli toinen joulupäivä on joulunseudun kirkkopyhä, ensimmäisen marttyyrin Stefanoksen ja hänen myötään kaikkien marttyyrien muistopäivä. Tapaninpäivä on aina ollut myös hevosten ja hevosmiesten päivä.\n\nTapaninpäivän perinteisiin kuuluu tapaninajelu, mieluiten hevosella. Hevosia opetettiin juoksemaan ja ajeltiin kylillä hupailemassa. Iloiset rekiretket tehtiin joukolla ja joulun hiljaisen hartaan tunnelman jälkeen nuoriso ja vanhempikin väki huristeli innoissaan kylänraitteja. Myös tapaninkulkueita, laulajia, jouluämmiä ja -äijiä liikkui eri puolilla kyliä."},{"date":"2021-01-01","name":"Uudenvuodenpäivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Uudenvuodenp%C3%A4iv%C3%A4","description":"Uusivuosi on juhla, jolla juhlistetaan vuoden vaihtumista, kun vanhan vuoden viimeinen päivä (uudenvuodenaatto) vaihtuu uuden vuoden ensimmäiseksi päiväksi (uudenvuodenpäivä). Uuttavuotta juhlitaan ympäri maailmaa eri tavoin. Uuden vuoden alkaessa on tapana muistella menneen vuoden tapahtumia sekä tehdä suunnitelmia alkavan vuoden varalle."},{"date":"2021-01-06","name":"Loppiainen","alternate_names":"Epifania; Teofania","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0017","description":"Loppiainen on kristillinen juhlapäivä, joka päättää joulun pyhät. Sitä nimitetään myös Jumalan ilmestymisen juhlaksi, ja se on todennäköisesti joulua vanhempi kristillinen juhla. Vaikka loppiainen suomen kielessä viittaa nimelläänkin jouluajan loppumiseen, suomalaisessa kansanperinteessä joulunajan on kuitenkin yleisesti katsottu jatkuvan sen jälkeenkin Nuutin päivään saakka.\n\nKatolisessa ja luterilaisessa kirkossa loppiaista vietetään itämaan tietäjien Betlehemiin saapumisen muistopäivänä. Monissa maissa sitä nimitetäänkin kolmen kuninkaan juhlaksi. Se on omistettu myös lähetystyölle."},{"date":"2021-02-07","name":"Kynttilänpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0088","description":"Kynttilänpäivä (kynttilämessu, ortodokseilla Herran temppeliintuominen) on kristillinen juhlapäivä, jota vietetään alkujaan 40 päivää joulusta sen muistoksi, että Jeesus vietiin 40 päivän ikäisenä temppeliin ja Simeon siunasi hänet.\n\nTapahtuman taustalla on kertomus vapautumisesta Egyptin orjuudesta ja juutalainen pääsiäinen. Sen mukaan jokainen esikoinen kuuluu Jumalalle, ja hänet lunastetaan Jumalalta. Taustalla ovat myös synnyttämiseen kuuluvat puhtaussäännökset."},{"date":"2021-02-14","name":"Laskiaissunnuntai","alternate_names":"Esto mihi; Quinquagesima; sovintosunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0026","description":"Laskiainen on katolisen kirkon kirkon kevätpaaston alkajaisjuhla. Suomessa sanaa käytetään nykyisin laskiaistiistaista.\n\nLaskiaista vietetään seitsemän viikkoa ennen pääsiäistä. Siihen kuuluvia juhlapäiviä ovat laskiaissunnuntai sekä kaksi päivää myöhemmin oleva laskiaistiistai, useissa maissa myös niiden välinen maanantai, joka esimerkiksi Saksassa tunnetaan nimellä Rosenmontag (\"ruusumaanantai\"). Laskiaisen jälkeen alka paastonaika, joka loppuu vasta pääsiäisenä. Oleellista paastonajalle oli liharuokien pois jättäminen ruokavaliosta, johon myös useat laskiaiseen liittyvät termit viittaavat. Laskiaistiistain jälkeinen tuhkakeskiviikko aloittaa 40 päivää kestävä paastoamisen."},{"date":"2021-03-21","name":"Marian ilmestyspäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0089","description":"Marian ilmestyspäivä eli marianpäivä on kristillinen juhlapäivä, joka juhlistaa arkkienkeli Gabrielin ilmestymistä Neitsyt Marialle ilmoittamaan Kristuksen tulevasta syntymästä. Tapauksesta kerrotaan Luukkaan evankeliumin ensimmäisessä luvussa.\n\nMarian ilmestyspäivän liturginen väri on valkoinen, Marian ilmestyspäivää edeltävän viikon värinä on sininen tai violetti."},{"date":"2021-03-28","name":"Palmusunnuntai","alternate_names":"virposunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0033","description":"Palmusunnuntai on kristillisen kirkkovuoden juhla, joka on viikkoa ennen pääsiäissunnuntaita. Palmusunnuntai aloittaa niin sanotun hiljaisen viikon, jolloin muistellaan Jeesuksen kärsimyksiä.\n\nPalmusunnuntaita vietetään sen tapauksen muistoksi, kun Jeesus saapui aasilla ratsastaen Jerusalemiin. Tapauksesta kerrotaan kaikissa evankeliumeissa. Palmusunnuntai on saanut nimensä palmunlehvistä, joita kansa levitti vaatteiden ohella Jeesuksen eteen. Ihmiset huusivat ja lauloivat \"Hoosianna\". Hoosianna on suoraan käännettynä \"oi, auta\", \"oi, pelasta\", mutta ajanlaskun alun aikoihin sitä käytettiin riemuhuutona.\n\nPohjoisessa ainoa elävä oksa pääsiäisen aikaan on paju, ja päivä tunnetaan myös virpa- tai virpomasunnuntain nimellä. Vanhastaan Karjalassa, nykyisin yleisesti koko Suomessa päivän perinteisiin kuuluu virpominen."},{"date":"2021-04-02","name":"Pitkäperjantai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0038","description":"Pitkäperjantai on pääsiäistä edeltävä perjantai. Se on Kristuksen ristiinnaulitsemis- ja kuolinpäivä ja kirkkovuoden ainoa surujuhla. Pitkäperjantai on yksi Suuren viikon juhlapyhistä.\n\nLuterilaisessa kirkossa pitkänperjantain jumalanpalvelusta vietetään ilman ehtoollista ja kellon- ja urkujensoittoa. Kello 15 voidaan viettää Jeesuksen kuolinhetken muistoa. Pitkänperjantain iltajumalanpalvelus taas on perinteisesti omistettu Jeesuksen hautaamiselle. Pitkäperjantai ja hiljainen lauantai ovat ainoat kirkkovuoden päivät, jolloin liturginen väri on musta."},{"date":"2021-04-04","name":"Pääsiäissunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0043","description":"Pääsiäinen on kristinuskon vuotuisjuhla, jota vietetään Jeesuksen ylösnousemuksen juhlana. Ylösnousemus on kristillisen uskon ydinkohtia, ja pääsiäinen kirkkovuoden vanhin ja tärkein juhla. Pääsiäistä edeltää hiljainen viikko, joka huipentuu pitkäperjantaihin, Jeesuksen ristiinnaulitsemisen päivään.\n\nPääsiäiseen liittyy useita keväisen luonnon heräävän elämän vertauskuvia. Näitä ovat muun muassa narsissit, rairuoho, keltaiset pääsiäistiput sekä kanit eli puput. Uutta elämää kuvaavat myös hiirenkorvalle puhkeavat koivunoksat ja pajunkissat. Muna on eri puolilla maailmaa tunnettu hedelmällisyyden ja kasvun vertauskuva."},{"date":"2021-04-05","name":"Toinen pääsiäispäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0044","description":"Toinen pääsiäispäivä on pääsiäispäivää seuraava maanantai. Päivänä muistetaan ylösnousseen Jeesuksen ilmestymistä opetuslapsille ja muutamille naisille. Ilmestykset vakuuttivat heidät hänen kuolleista nousemisestaan ja jatkuvasta läsnäolostaan. Teemana \"seurakunta elää Ylösnousseen seurassa\"."},{"date":"2021-05-01","name":"Vappu","flag_day":1,"alternate_names":"suomalaisen työn päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Vappu","description":"Vappu on kansainvälinen juhlapäivä ja monissa maissa yleinen vapaapäivä. Se on alkavan kevään juhlapäivä sekä kansainvälinen työväen juhlapäivä. Suomessa vapunpäivää aattopäivineen vietetään työväen, ylioppilaiden ja kevään karnevaalijuhlana. Vuodesta 1979 lähtien vappu on ollut Suomessa virallinen liputuspäivä, suomalaisen työn päivä.\n\nNimi vappu tulee 700-luvulla eläneestä baijerilaisesta abbedissa Valburgista. Vappua on juhlittu keskiajalta lähtien - myös Suomessa - 1. toukokuuta, joka on Valburgin pyhimykseksi julistamisen päivä. Sen mukaisesti päivä on myös Vapun ja Valpurin nimipäivä. Nykyään päivä ei ole kirkollinen juhlapäivä, vaikka onkin yleinen vapaapäivä, mutta aikoinaan samaksi päiväksi sattui myös apostolien Filippuksen ja Jaakobin muistopäivä."},{"date":"2021-05-13","name":"Helatorstai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0055","description":"Helatorstai on vuotuinen kristillinen juhla, jota vietetään neljäntenäkymmenentenä päivänä pääsiäisestä Jeesuksen taivaaseenastumisen muistoksi.\n\nUseimmissa kielissä päivän nimi viittaa suoraan juhlan aiheeseen, Kristuksen taivaaseenastumiseen. Suomen kielessä sillä on kuitenkin perinteinen, alkujaan ruotsista lainattu nimi, jonka alkuosa hela viittaa ruotsin kielen pyhää tarkoittavaan sanaan helg."},{"date":"2021-05-16","name":"Kaatuneiden muistopäivä","flag_day":1,"age":81,"url":"https:\/\/fi.wikipedia.org\/wiki\/Kaatuneiden_muistop%C3%A4iv%C3%A4","description":"Kaatuneiden muistopäivä on sodassa kaatuneiden vainajien muistoksi järjestetty päivä. Järjestelyihin kuuluu valtakunnallinen pääjuhla, paikallisia muistotilaisuuksia jumalanpalveluksineen ja sankarihaudoilla käynteineen. Nykyisin muistopäivänä kunnioitetaan itsenäisen Suomen kaikkien sotien kaikkia vainajia."},{"date":"2021-05-23","name":"Helluntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0058","description":"Helluntai on Pyhän Hengen vuodattamiselle omistettu kristillinen juhlapäivä. Helluntaita vietetään seitsemän viikon kuluttua pääsiäisestä ja kymmenen päivää helatorstain jälkeen. Suomen kieleen sana helluntai on tullut ruotsin kielen sanoista helig dag, pyhä päivä.\n\nAlkuperältään ja ajankohdaltaan helluntai liittyy myös juutalaisten shavuot-juhlaan eli viikkojuhlaan, jota vietetään seitsemän viikkoa juutalaisten pääsiäisen eli pesahin jälkeen toisaalta sadonkorjuu­juhlana, toisaalta Siinailla tapahtuneen lain antamisen muisto­juhlana.\n\nSuomessa helluntai on kirkkolain mukainen kirkollinen juhlapäivä. Kaupat pidetään silloin eräin poikkeuksin laki­sääteisesti kiinni."},{"date":"2021-05-30","name":"Pyhän Kolminaisuuden päivä","alternate_names":"1. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0060","description":"Pyhän Kolminaisuuden päivä on kristillinen juhlapäivä, jota vietetään ensimmäisenä sunnuntaina helluntain jälkeen. Sen vietto sai alkunsa Englannissa 1000-luvulla. Päivä on omistettu Pyhälle Kolminaisuudelle. Pyhän kolminaisuuden päivän liturginen väri on valkoinen."},{"date":"2021-06-26","name":"Juhannus","flag_day":1,"alternate_names":"Johannes Kastajan päivä; Suomen lipun päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Juhannus","description":"Juhannus on suomalainen nimi keskikesän juhlalle, jota vietetään kesäkuussa kesäpäivänseisauksen lähellä. Pohjoisessa juhannus on valon juhla, jolloin keskikesä on kauneimmillaan.\n\nSuomalaiseen juhannukseen kuuluvat kiinteästi juhannussauna, juhannuskokko, juhannustanssit ja muut juhlat. Suomessa juhannus on myös virallinen liputuspäivä, jolloin liputetaan koko juhannusyön ajan. Monet juhannuksen perinteistä juontavat juurensa vanhaan eurooppalaiseen valon ja hedelmällisyyden juhlaan kesäpäivänseisauksen aikana.\n\nSuomessa ja Ruotsissa juhannus on ollut tärkeä kansanomainen merkkipäivä. Juhannukseen on vanhastaan liittynyt erilaisia uskomuksia ja taikoja, joilla on pyritty varmistamaan tuleva sato ja naimaonni. Monet kristilliset kirkkokunnat viettävät juhannusta Johannes Kastajan muistopäivänä, mistä tulee nimi juhannus.\n\nJuhannus on virallinen liputuspäivä, Suomen lipun päivä. Muista liputuspäivistä poiketen silloin liputus alkaa jo aattoiltana kello 18 ja jatkuu yön yli yhtäjaksoisesti juhannuspäivän iltaan kello 21 saakka."},{"date":"2021-07-04","name":"Apostolien päivä","alternate_names":"6. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0065","description":"Apostolien päivää on vietetty Pietarin ja Paavalin marttyyrikuolemiensa muistoksi Keskiajalla, mutta nykyään Apostolien päivänä muistellaan kaikki apostoleja. Liturginen väri on punainen ja alttarikynttilöitä on neljä."},{"date":"2021-07-18","name":"Kirkastussunnuntai","alternate_names":"8. sunnuntai helluntaista; Kristuksen kirkastumisen päivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0067","description":"Kirkastussunnuntai on Suomen evankelis-luterilaisen kirkon kirkkovuodessa nimitys seitsemännelle kolminaisuudenpäivän jälkeiselle sunnuntaille eli kahdeksannelle sunnuntaille helluntaista. Päivää vietetään Kristuksen kirkastumisen muistoksi."},{"date":"2021-10-03","name":"Mikkelinpäivä","alternate_names":"Enkelien sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0091","description":"Mikkelinpäivä on alun perin arkkienkeli Mikaelin, mutta nykyisin päivä on omistettu kaikille enkeleille."},{"date":"2021-11-06","name":"Pyhäinpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0092","description":"Pyhäinpäivä on kristillinen pyhimysten, marttyyrien ja vainajien muistopäivä\n\nNykyinen suomalainen pyhäinpäivä on yhdistelmä kahdesta varsinkin katolisen kirkon keskiajalta lähtien viettämästä juhlasta, jotka ovat kaikkien pyhien päivä 1. marraskuuta ja kaikkien uskovien vainajien muistopäivä 2. marraskuuta. Suomessa siitä on tullut yleinen vainajien muistopäivä. Silloin monet vievät läheisten haudalle esimerkiksi kynttilän tai kukkia kuolleiden muistoksi. Kotona voidaan myös sytyttää kynttilä läheisen muistoksi.\n\nVanhoista ajoista on Suomessa vietetty syksyllä sadonkorjuun päättymisen jälkeen kekriä. Koska se ajankohdaltaan sattui lähelle kristillistä pyhäinpäivää, se on myöhempinä aikoina usein samastettukin pyhäinpäivän kanssa, josta kansanomaisesti onkin käytetty myös nimitystä kekri."},{"date":"2021-11-21","name":"Tuomiosunnuntai","alternate_names":"Kristuksen kuninkuuden sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0087","description":"Tuomiosunnuntai kirkkovuoden viimeinen sunnuntai. Sen nimi vaihtelee eri kirkkokunnissa, Suomessa se on Ruotsin mallin mukaan 'tuomiosunnuntai'. Tuomiosunnuntain liturginen väri on vihreä.\n\nTuomiosunnuntain sanoma liittyy Kristuksen toiseen tulemukseen, nyt kuninkaana ja vanhurskaana tuomarina."},{"date":"2021-12-06","name":"Suomen itsenäisyyspäivä","flag_day":1,"age":104,"url":"https:\/\/fi.wikipedia.org\/wiki\/Suomen_itsen%C3%A4isyysp%C3%A4iv%C3%A4","description":"Suomen itsenäisyyspäivä on Suomen kansallispäivä, jota vietetään 6. joulukuuta 1917 tapahtuneen itsenäistymisen kunniaksi. Itsenäisen Suomea edelsi Suomen suuriruhtinaskunta, joka oli itsehallinnollinen osa Venäjän keisarikuntaa.\n\nJoulukuun 6. päivää on vietetty itsenäisyyspäivänä vuodesta 1919 lähtien. Asiasta päätti Valtioneuvosto, ja päivästä tuli vapaapäivä valtion virastoissa, kouluissa ja tuomioistuimissa. Vuonna 1929 säädettiin lailla yleiseksi palkalliseksi vapaapäiväksi. Vuonna 1937 säädettiin laki itsenäisyyspäivän viettämisestä yleisenä juhla- ja vapaapäivänä. Sen mukaan päivä itsenäisyyspäivän tuli olla palkallinen vapaapäivä, tai missä se ei ole mahdollista, on maksettava korotettua palkkaa kuten sunnuntaityöstä.\n\nItsenäisyyspäivä on myös virallinen liputuspäivä. Silloin liputus päättyy muista liputuspäivistä poikkeavasti klo 20."},{"date":"2021-12-25","name":"Joulupäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0009","description":"Joulua vietetään Jeesuksen syntymän muistoksi. Joulun vietto alkaa Suomessa yleensä jo aattoiltana, joulukuun 25. päivä on kuitenkin varsinainen joulupäivä.\n\nJoulun ajankohta on muinaisen roomalaisen kalenterin talvipäivänseisauksen päivämäärä. Suomen kielen sana joulu ja juhla ovat ruotsalaisia tai skandinaavisia lainasanoja. Sana joulu tulee alun perin ennen kristinuskoa vietetyn talvipäivänseisauksen juhlan muinaisgermaanisesta nimestä. Joulussa ovat yhdistyneet kristillinen juhla, muinainen roomalainen saturnalia-juhla sekä Euroopan pohjoisten kansojen maatalousvuoden päättäjäis- ja keskitalven juhla (yule), Suomessa vanha vuodenvaihteenjuhla kekri. Joulu on yleinen perhejuhla eri puolilla maailmaa."},{"date":"2021-12-26","name":"Tapaninpäivä","alternate_names":"2. joulupäivä; marttyyri Stefanoksen ja kaikkien marttyyrien muistopäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0010","description":"Tapaninpäivä eli toinen joulupäivä on joulunseudun kirkkopyhä, ensimmäisen marttyyrin Stefanoksen ja hänen myötään kaikkien marttyyrien muistopäivä. Tapaninpäivä on aina ollut myös hevosten ja hevosmiesten päivä.\n\nTapaninpäivän perinteisiin kuuluu tapaninajelu, mieluiten hevosella. Hevosia opetettiin juoksemaan ja ajeltiin kylillä hupailemassa. Iloiset rekiretket tehtiin joukolla ja joulun hiljaisen hartaan tunnelman jälkeen nuoriso ja vanhempikin väki huristeli innoissaan kylänraitteja. Myös tapaninkulkueita, laulajia, jouluämmiä ja -äijiä liikkui eri puolilla kyliä."},{"date":"2022-01-01","name":"Uudenvuodenpäivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Uudenvuodenp%C3%A4iv%C3%A4","description":"Uusivuosi on juhla, jolla juhlistetaan vuoden vaihtumista, kun vanhan vuoden viimeinen päivä (uudenvuodenaatto) vaihtuu uuden vuoden ensimmäiseksi päiväksi (uudenvuodenpäivä). Uuttavuotta juhlitaan ympäri maailmaa eri tavoin. Uuden vuoden alkaessa on tapana muistella menneen vuoden tapahtumia sekä tehdä suunnitelmia alkavan vuoden varalle."},{"date":"2022-01-06","name":"Loppiainen","alternate_names":"Epifania; Teofania","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0017","description":"Loppiainen on kristillinen juhlapäivä, joka päättää joulun pyhät. Sitä nimitetään myös Jumalan ilmestymisen juhlaksi, ja se on todennäköisesti joulua vanhempi kristillinen juhla. Vaikka loppiainen suomen kielessä viittaa nimelläänkin jouluajan loppumiseen, suomalaisessa kansanperinteessä joulunajan on kuitenkin yleisesti katsottu jatkuvan sen jälkeenkin Nuutin päivään saakka.\n\nKatolisessa ja luterilaisessa kirkossa loppiaista vietetään itämaan tietäjien Betlehemiin saapumisen muistopäivänä. Monissa maissa sitä nimitetäänkin kolmen kuninkaan juhlaksi. Se on omistettu myös lähetystyölle."},{"date":"2022-02-06","name":"Kynttilänpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0088","description":"Kynttilänpäivä (kynttilämessu, ortodokseilla Herran temppeliintuominen) on kristillinen juhlapäivä, jota vietetään alkujaan 40 päivää joulusta sen muistoksi, että Jeesus vietiin 40 päivän ikäisenä temppeliin ja Simeon siunasi hänet.\n\nTapahtuman taustalla on kertomus vapautumisesta Egyptin orjuudesta ja juutalainen pääsiäinen. Sen mukaan jokainen esikoinen kuuluu Jumalalle, ja hänet lunastetaan Jumalalta. Taustalla ovat myös synnyttämiseen kuuluvat puhtaussäännökset."},{"date":"2022-02-27","name":"Laskiaissunnuntai","alternate_names":"Esto mihi; Quinquagesima; sovintosunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0026","description":"Laskiainen on katolisen kirkon kirkon kevätpaaston alkajaisjuhla. Suomessa sanaa käytetään nykyisin laskiaistiistaista.\n\nLaskiaista vietetään seitsemän viikkoa ennen pääsiäistä. Siihen kuuluvia juhlapäiviä ovat laskiaissunnuntai sekä kaksi päivää myöhemmin oleva laskiaistiistai, useissa maissa myös niiden välinen maanantai, joka esimerkiksi Saksassa tunnetaan nimellä Rosenmontag (\"ruusumaanantai\"). Laskiaisen jälkeen alka paastonaika, joka loppuu vasta pääsiäisenä. Oleellista paastonajalle oli liharuokien pois jättäminen ruokavaliosta, johon myös useat laskiaiseen liittyvät termit viittaavat. Laskiaistiistain jälkeinen tuhkakeskiviikko aloittaa 40 päivää kestävä paastoamisen."},{"date":"2022-03-27","name":"Marian ilmestyspäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0089","description":"Marian ilmestyspäivä eli marianpäivä on kristillinen juhlapäivä, joka juhlistaa arkkienkeli Gabrielin ilmestymistä Neitsyt Marialle ilmoittamaan Kristuksen tulevasta syntymästä. Tapauksesta kerrotaan Luukkaan evankeliumin ensimmäisessä luvussa.\n\nMarian ilmestyspäivän liturginen väri on valkoinen, Marian ilmestyspäivää edeltävän viikon värinä on sininen tai violetti."},{"date":"2022-04-10","name":"Palmusunnuntai","alternate_names":"virposunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0033","description":"Palmusunnuntai on kristillisen kirkkovuoden juhla, joka on viikkoa ennen pääsiäissunnuntaita. Palmusunnuntai aloittaa niin sanotun hiljaisen viikon, jolloin muistellaan Jeesuksen kärsimyksiä.\n\nPalmusunnuntaita vietetään sen tapauksen muistoksi, kun Jeesus saapui aasilla ratsastaen Jerusalemiin. Tapauksesta kerrotaan kaikissa evankeliumeissa. Palmusunnuntai on saanut nimensä palmunlehvistä, joita kansa levitti vaatteiden ohella Jeesuksen eteen. Ihmiset huusivat ja lauloivat \"Hoosianna\". Hoosianna on suoraan käännettynä \"oi, auta\", \"oi, pelasta\", mutta ajanlaskun alun aikoihin sitä käytettiin riemuhuutona.\n\nPohjoisessa ainoa elävä oksa pääsiäisen aikaan on paju, ja päivä tunnetaan myös virpa- tai virpomasunnuntain nimellä. Vanhastaan Karjalassa, nykyisin yleisesti koko Suomessa päivän perinteisiin kuuluu virpominen."},{"date":"2022-04-15","name":"Pitkäperjantai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0038","description":"Pitkäperjantai on pääsiäistä edeltävä perjantai. Se on Kristuksen ristiinnaulitsemis- ja kuolinpäivä ja kirkkovuoden ainoa surujuhla. Pitkäperjantai on yksi Suuren viikon juhlapyhistä.\n\nLuterilaisessa kirkossa pitkänperjantain jumalanpalvelusta vietetään ilman ehtoollista ja kellon- ja urkujensoittoa. Kello 15 voidaan viettää Jeesuksen kuolinhetken muistoa. Pitkänperjantain iltajumalanpalvelus taas on perinteisesti omistettu Jeesuksen hautaamiselle. Pitkäperjantai ja hiljainen lauantai ovat ainoat kirkkovuoden päivät, jolloin liturginen väri on musta."},{"date":"2022-04-17","name":"Pääsiäissunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0043","description":"Pääsiäinen on kristinuskon vuotuisjuhla, jota vietetään Jeesuksen ylösnousemuksen juhlana. Ylösnousemus on kristillisen uskon ydinkohtia, ja pääsiäinen kirkkovuoden vanhin ja tärkein juhla. Pääsiäistä edeltää hiljainen viikko, joka huipentuu pitkäperjantaihin, Jeesuksen ristiinnaulitsemisen päivään.\n\nPääsiäiseen liittyy useita keväisen luonnon heräävän elämän vertauskuvia. Näitä ovat muun muassa narsissit, rairuoho, keltaiset pääsiäistiput sekä kanit eli puput. Uutta elämää kuvaavat myös hiirenkorvalle puhkeavat koivunoksat ja pajunkissat. Muna on eri puolilla maailmaa tunnettu hedelmällisyyden ja kasvun vertauskuva."},{"date":"2022-04-18","name":"Toinen pääsiäispäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0044","description":"Toinen pääsiäispäivä on pääsiäispäivää seuraava maanantai. Päivänä muistetaan ylösnousseen Jeesuksen ilmestymistä opetuslapsille ja muutamille naisille. Ilmestykset vakuuttivat heidät hänen kuolleista nousemisestaan ja jatkuvasta läsnäolostaan. Teemana \"seurakunta elää Ylösnousseen seurassa\"."},{"date":"2022-05-01","name":"Vappu","flag_day":1,"alternate_names":"suomalaisen työn päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Vappu","description":"Vappu on kansainvälinen juhlapäivä ja monissa maissa yleinen vapaapäivä. Se on alkavan kevään juhlapäivä sekä kansainvälinen työväen juhlapäivä. Suomessa vapunpäivää aattopäivineen vietetään työväen, ylioppilaiden ja kevään karnevaalijuhlana. Vuodesta 1979 lähtien vappu on ollut Suomessa virallinen liputuspäivä, suomalaisen työn päivä.\n\nNimi vappu tulee 700-luvulla eläneestä baijerilaisesta abbedissa Valburgista. Vappua on juhlittu keskiajalta lähtien - myös Suomessa - 1. toukokuuta, joka on Valburgin pyhimykseksi julistamisen päivä. Sen mukaisesti päivä on myös Vapun ja Valpurin nimipäivä. Nykyään päivä ei ole kirkollinen juhlapäivä, vaikka onkin yleinen vapaapäivä, mutta aikoinaan samaksi päiväksi sattui myös apostolien Filippuksen ja Jaakobin muistopäivä."},{"date":"2022-05-15","name":"Kaatuneiden muistopäivä","flag_day":1,"age":82,"url":"https:\/\/fi.wikipedia.org\/wiki\/Kaatuneiden_muistop%C3%A4iv%C3%A4","description":"Kaatuneiden muistopäivä on sodassa kaatuneiden vainajien muistoksi järjestetty päivä. Järjestelyihin kuuluu valtakunnallinen pääjuhla, paikallisia muistotilaisuuksia jumalanpalveluksineen ja sankarihaudoilla käynteineen. Nykyisin muistopäivänä kunnioitetaan itsenäisen Suomen kaikkien sotien kaikkia vainajia."},{"date":"2022-05-26","name":"Helatorstai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0055","description":"Helatorstai on vuotuinen kristillinen juhla, jota vietetään neljäntenäkymmenentenä päivänä pääsiäisestä Jeesuksen taivaaseenastumisen muistoksi.\n\nUseimmissa kielissä päivän nimi viittaa suoraan juhlan aiheeseen, Kristuksen taivaaseenastumiseen. Suomen kielessä sillä on kuitenkin perinteinen, alkujaan ruotsista lainattu nimi, jonka alkuosa hela viittaa ruotsin kielen pyhää tarkoittavaan sanaan helg."},{"date":"2022-06-05","name":"Helluntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0058","description":"Helluntai on Pyhän Hengen vuodattamiselle omistettu kristillinen juhlapäivä. Helluntaita vietetään seitsemän viikon kuluttua pääsiäisestä ja kymmenen päivää helatorstain jälkeen. Suomen kieleen sana helluntai on tullut ruotsin kielen sanoista helig dag, pyhä päivä.\n\nAlkuperältään ja ajankohdaltaan helluntai liittyy myös juutalaisten shavuot-juhlaan eli viikkojuhlaan, jota vietetään seitsemän viikkoa juutalaisten pääsiäisen eli pesahin jälkeen toisaalta sadonkorjuu­juhlana, toisaalta Siinailla tapahtuneen lain antamisen muisto­juhlana.\n\nSuomessa helluntai on kirkkolain mukainen kirkollinen juhlapäivä. Kaupat pidetään silloin eräin poikkeuksin laki­sääteisesti kiinni."},{"date":"2022-06-12","name":"Pyhän Kolminaisuuden päivä","alternate_names":"1. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0060","description":"Pyhän Kolminaisuuden päivä on kristillinen juhlapäivä, jota vietetään ensimmäisenä sunnuntaina helluntain jälkeen. Sen vietto sai alkunsa Englannissa 1000-luvulla. Päivä on omistettu Pyhälle Kolminaisuudelle. Pyhän kolminaisuuden päivän liturginen väri on valkoinen."},{"date":"2022-06-25","name":"Juhannus","flag_day":1,"alternate_names":"Johannes Kastajan päivä; Suomen lipun päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Juhannus","description":"Juhannus on suomalainen nimi keskikesän juhlalle, jota vietetään kesäkuussa kesäpäivänseisauksen lähellä. Pohjoisessa juhannus on valon juhla, jolloin keskikesä on kauneimmillaan.\n\nSuomalaiseen juhannukseen kuuluvat kiinteästi juhannussauna, juhannuskokko, juhannustanssit ja muut juhlat. Suomessa juhannus on myös virallinen liputuspäivä, jolloin liputetaan koko juhannusyön ajan. Monet juhannuksen perinteistä juontavat juurensa vanhaan eurooppalaiseen valon ja hedelmällisyyden juhlaan kesäpäivänseisauksen aikana.\n\nSuomessa ja Ruotsissa juhannus on ollut tärkeä kansanomainen merkkipäivä. Juhannukseen on vanhastaan liittynyt erilaisia uskomuksia ja taikoja, joilla on pyritty varmistamaan tuleva sato ja naimaonni. Monet kristilliset kirkkokunnat viettävät juhannusta Johannes Kastajan muistopäivänä, mistä tulee nimi juhannus.\n\nJuhannus on virallinen liputuspäivä, Suomen lipun päivä. Muista liputuspäivistä poiketen silloin liputus alkaa jo aattoiltana kello 18 ja jatkuu yön yli yhtäjaksoisesti juhannuspäivän iltaan kello 21 saakka."},{"date":"2022-07-17","name":"Apostolien päivä","alternate_names":"6. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0065","description":"Apostolien päivää on vietetty Pietarin ja Paavalin marttyyrikuolemiensa muistoksi Keskiajalla, mutta nykyään Apostolien päivänä muistellaan kaikki apostoleja. Liturginen väri on punainen ja alttarikynttilöitä on neljä."},{"date":"2022-07-31","name":"Kirkastussunnuntai","alternate_names":"8. sunnuntai helluntaista; Kristuksen kirkastumisen päivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0067","description":"Kirkastussunnuntai on Suomen evankelis-luterilaisen kirkon kirkkovuodessa nimitys seitsemännelle kolminaisuudenpäivän jälkeiselle sunnuntaille eli kahdeksannelle sunnuntaille helluntaista. Päivää vietetään Kristuksen kirkastumisen muistoksi."},{"date":"2022-10-02","name":"Mikkelinpäivä","alternate_names":"Enkelien sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0091","description":"Mikkelinpäivä on alun perin arkkienkeli Mikaelin, mutta nykyisin päivä on omistettu kaikille enkeleille."},{"date":"2022-11-05","name":"Pyhäinpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0092","description":"Pyhäinpäivä on kristillinen pyhimysten, marttyyrien ja vainajien muistopäivä\n\nNykyinen suomalainen pyhäinpäivä on yhdistelmä kahdesta varsinkin katolisen kirkon keskiajalta lähtien viettämästä juhlasta, jotka ovat kaikkien pyhien päivä 1. marraskuuta ja kaikkien uskovien vainajien muistopäivä 2. marraskuuta. Suomessa siitä on tullut yleinen vainajien muistopäivä. Silloin monet vievät läheisten haudalle esimerkiksi kynttilän tai kukkia kuolleiden muistoksi. Kotona voidaan myös sytyttää kynttilä läheisen muistoksi.\n\nVanhoista ajoista on Suomessa vietetty syksyllä sadonkorjuun päättymisen jälkeen kekriä. Koska se ajankohdaltaan sattui lähelle kristillistä pyhäinpäivää, se on myöhempinä aikoina usein samastettukin pyhäinpäivän kanssa, josta kansanomaisesti onkin käytetty myös nimitystä kekri."},{"date":"2022-11-20","name":"Tuomiosunnuntai","alternate_names":"Kristuksen kuninkuuden sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0087","description":"Tuomiosunnuntai kirkkovuoden viimeinen sunnuntai. Sen nimi vaihtelee eri kirkkokunnissa, Suomessa se on Ruotsin mallin mukaan 'tuomiosunnuntai'. Tuomiosunnuntain liturginen väri on vihreä.\n\nTuomiosunnuntain sanoma liittyy Kristuksen toiseen tulemukseen, nyt kuninkaana ja vanhurskaana tuomarina."},{"date":"2022-12-06","name":"Suomen itsenäisyyspäivä","flag_day":1,"age":105,"url":"https:\/\/fi.wikipedia.org\/wiki\/Suomen_itsen%C3%A4isyysp%C3%A4iv%C3%A4","description":"Suomen itsenäisyyspäivä on Suomen kansallispäivä, jota vietetään 6. joulukuuta 1917 tapahtuneen itsenäistymisen kunniaksi. Itsenäisen Suomea edelsi Suomen suuriruhtinaskunta, joka oli itsehallinnollinen osa Venäjän keisarikuntaa.\n\nJoulukuun 6. päivää on vietetty itsenäisyyspäivänä vuodesta 1919 lähtien. Asiasta päätti Valtioneuvosto, ja päivästä tuli vapaapäivä valtion virastoissa, kouluissa ja tuomioistuimissa. Vuonna 1929 säädettiin lailla yleiseksi palkalliseksi vapaapäiväksi. Vuonna 1937 säädettiin laki itsenäisyyspäivän viettämisestä yleisenä juhla- ja vapaapäivänä. Sen mukaan päivä itsenäisyyspäivän tuli olla palkallinen vapaapäivä, tai missä se ei ole mahdollista, on maksettava korotettua palkkaa kuten sunnuntaityöstä.\n\nItsenäisyyspäivä on myös virallinen liputuspäivä. Silloin liputus päättyy muista liputuspäivistä poikkeavasti klo 20."},{"date":"2022-12-25","name":"Joulupäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0009","description":"Joulua vietetään Jeesuksen syntymän muistoksi. Joulun vietto alkaa Suomessa yleensä jo aattoiltana, joulukuun 25. päivä on kuitenkin varsinainen joulupäivä.\n\nJoulun ajankohta on muinaisen roomalaisen kalenterin talvipäivänseisauksen päivämäärä. Suomen kielen sana joulu ja juhla ovat ruotsalaisia tai skandinaavisia lainasanoja. Sana joulu tulee alun perin ennen kristinuskoa vietetyn talvipäivänseisauksen juhlan muinaisgermaanisesta nimestä. Joulussa ovat yhdistyneet kristillinen juhla, muinainen roomalainen saturnalia-juhla sekä Euroopan pohjoisten kansojen maatalousvuoden päättäjäis- ja keskitalven juhla (yule), Suomessa vanha vuodenvaihteenjuhla kekri. Joulu on yleinen perhejuhla eri puolilla maailmaa."},{"date":"2022-12-26","name":"Tapaninpäivä","alternate_names":"2. joulupäivä; marttyyri Stefanoksen ja kaikkien marttyyrien muistopäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0010","description":"Tapaninpäivä eli toinen joulupäivä on joulunseudun kirkkopyhä, ensimmäisen marttyyrin Stefanoksen ja hänen myötään kaikkien marttyyrien muistopäivä. Tapaninpäivä on aina ollut myös hevosten ja hevosmiesten päivä.\n\nTapaninpäivän perinteisiin kuuluu tapaninajelu, mieluiten hevosella. Hevosia opetettiin juoksemaan ja ajeltiin kylillä hupailemassa. Iloiset rekiretket tehtiin joukolla ja joulun hiljaisen hartaan tunnelman jälkeen nuoriso ja vanhempikin väki huristeli innoissaan kylänraitteja. Myös tapaninkulkueita, laulajia, jouluämmiä ja -äijiä liikkui eri puolilla kyliä."},{"date":"2023-01-01","name":"Uudenvuodenpäivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Uudenvuodenp%C3%A4iv%C3%A4","description":"Uusivuosi on juhla, jolla juhlistetaan vuoden vaihtumista, kun vanhan vuoden viimeinen päivä (uudenvuodenaatto) vaihtuu uuden vuoden ensimmäiseksi päiväksi (uudenvuodenpäivä). Uuttavuotta juhlitaan ympäri maailmaa eri tavoin. Uuden vuoden alkaessa on tapana muistella menneen vuoden tapahtumia sekä tehdä suunnitelmia alkavan vuoden varalle."},{"date":"2023-01-06","name":"Loppiainen","alternate_names":"Epifania; Teofania","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0017","description":"Loppiainen on kristillinen juhlapäivä, joka päättää joulun pyhät. Sitä nimitetään myös Jumalan ilmestymisen juhlaksi, ja se on todennäköisesti joulua vanhempi kristillinen juhla. Vaikka loppiainen suomen kielessä viittaa nimelläänkin jouluajan loppumiseen, suomalaisessa kansanperinteessä joulunajan on kuitenkin yleisesti katsottu jatkuvan sen jälkeenkin Nuutin päivään saakka.\n\nKatolisessa ja luterilaisessa kirkossa loppiaista vietetään itämaan tietäjien Betlehemiin saapumisen muistopäivänä. Monissa maissa sitä nimitetäänkin kolmen kuninkaan juhlaksi. Se on omistettu myös lähetystyölle."},{"date":"2023-02-05","name":"Kynttilänpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0088","description":"Kynttilänpäivä (kynttilämessu, ortodokseilla Herran temppeliintuominen) on kristillinen juhlapäivä, jota vietetään alkujaan 40 päivää joulusta sen muistoksi, että Jeesus vietiin 40 päivän ikäisenä temppeliin ja Simeon siunasi hänet.\n\nTapahtuman taustalla on kertomus vapautumisesta Egyptin orjuudesta ja juutalainen pääsiäinen. Sen mukaan jokainen esikoinen kuuluu Jumalalle, ja hänet lunastetaan Jumalalta. Taustalla ovat myös synnyttämiseen kuuluvat puhtaussäännökset."},{"date":"2023-02-19","name":"Laskiaissunnuntai","alternate_names":"Esto mihi; Quinquagesima; sovintosunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0026","description":"Laskiainen on katolisen kirkon kirkon kevätpaaston alkajaisjuhla. Suomessa sanaa käytetään nykyisin laskiaistiistaista.\n\nLaskiaista vietetään seitsemän viikkoa ennen pääsiäistä. Siihen kuuluvia juhlapäiviä ovat laskiaissunnuntai sekä kaksi päivää myöhemmin oleva laskiaistiistai, useissa maissa myös niiden välinen maanantai, joka esimerkiksi Saksassa tunnetaan nimellä Rosenmontag (\"ruusumaanantai\"). Laskiaisen jälkeen alka paastonaika, joka loppuu vasta pääsiäisenä. Oleellista paastonajalle oli liharuokien pois jättäminen ruokavaliosta, johon myös useat laskiaiseen liittyvät termit viittaavat. Laskiaistiistain jälkeinen tuhkakeskiviikko aloittaa 40 päivää kestävä paastoamisen."},{"date":"2023-03-26","name":"Marian ilmestyspäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0089","description":"Marian ilmestyspäivä eli marianpäivä on kristillinen juhlapäivä, joka juhlistaa arkkienkeli Gabrielin ilmestymistä Neitsyt Marialle ilmoittamaan Kristuksen tulevasta syntymästä. Tapauksesta kerrotaan Luukkaan evankeliumin ensimmäisessä luvussa.\n\nMarian ilmestyspäivän liturginen väri on valkoinen, Marian ilmestyspäivää edeltävän viikon värinä on sininen tai violetti."},{"date":"2023-04-02","name":"Palmusunnuntai","alternate_names":"virposunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0033","description":"Palmusunnuntai on kristillisen kirkkovuoden juhla, joka on viikkoa ennen pääsiäissunnuntaita. Palmusunnuntai aloittaa niin sanotun hiljaisen viikon, jolloin muistellaan Jeesuksen kärsimyksiä.\n\nPalmusunnuntaita vietetään sen tapauksen muistoksi, kun Jeesus saapui aasilla ratsastaen Jerusalemiin. Tapauksesta kerrotaan kaikissa evankeliumeissa. Palmusunnuntai on saanut nimensä palmunlehvistä, joita kansa levitti vaatteiden ohella Jeesuksen eteen. Ihmiset huusivat ja lauloivat \"Hoosianna\". Hoosianna on suoraan käännettynä \"oi, auta\", \"oi, pelasta\", mutta ajanlaskun alun aikoihin sitä käytettiin riemuhuutona.\n\nPohjoisessa ainoa elävä oksa pääsiäisen aikaan on paju, ja päivä tunnetaan myös virpa- tai virpomasunnuntain nimellä. Vanhastaan Karjalassa, nykyisin yleisesti koko Suomessa päivän perinteisiin kuuluu virpominen."},{"date":"2023-04-07","name":"Pitkäperjantai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0038","description":"Pitkäperjantai on pääsiäistä edeltävä perjantai. Se on Kristuksen ristiinnaulitsemis- ja kuolinpäivä ja kirkkovuoden ainoa surujuhla. Pitkäperjantai on yksi Suuren viikon juhlapyhistä.\n\nLuterilaisessa kirkossa pitkänperjantain jumalanpalvelusta vietetään ilman ehtoollista ja kellon- ja urkujensoittoa. Kello 15 voidaan viettää Jeesuksen kuolinhetken muistoa. Pitkänperjantain iltajumalanpalvelus taas on perinteisesti omistettu Jeesuksen hautaamiselle. Pitkäperjantai ja hiljainen lauantai ovat ainoat kirkkovuoden päivät, jolloin liturginen väri on musta."},{"date":"2023-04-09","name":"Pääsiäissunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0043","description":"Pääsiäinen on kristinuskon vuotuisjuhla, jota vietetään Jeesuksen ylösnousemuksen juhlana. Ylösnousemus on kristillisen uskon ydinkohtia, ja pääsiäinen kirkkovuoden vanhin ja tärkein juhla. Pääsiäistä edeltää hiljainen viikko, joka huipentuu pitkäperjantaihin, Jeesuksen ristiinnaulitsemisen päivään.\n\nPääsiäiseen liittyy useita keväisen luonnon heräävän elämän vertauskuvia. Näitä ovat muun muassa narsissit, rairuoho, keltaiset pääsiäistiput sekä kanit eli puput. Uutta elämää kuvaavat myös hiirenkorvalle puhkeavat koivunoksat ja pajunkissat. Muna on eri puolilla maailmaa tunnettu hedelmällisyyden ja kasvun vertauskuva."},{"date":"2023-04-10","name":"Toinen pääsiäispäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0044","description":"Toinen pääsiäispäivä on pääsiäispäivää seuraava maanantai. Päivänä muistetaan ylösnousseen Jeesuksen ilmestymistä opetuslapsille ja muutamille naisille. Ilmestykset vakuuttivat heidät hänen kuolleista nousemisestaan ja jatkuvasta läsnäolostaan. Teemana \"seurakunta elää Ylösnousseen seurassa\"."},{"date":"2023-05-01","name":"Vappu","flag_day":1,"alternate_names":"suomalaisen työn päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Vappu","description":"Vappu on kansainvälinen juhlapäivä ja monissa maissa yleinen vapaapäivä. Se on alkavan kevään juhlapäivä sekä kansainvälinen työväen juhlapäivä. Suomessa vapunpäivää aattopäivineen vietetään työväen, ylioppilaiden ja kevään karnevaalijuhlana. Vuodesta 1979 lähtien vappu on ollut Suomessa virallinen liputuspäivä, suomalaisen työn päivä.\n\nNimi vappu tulee 700-luvulla eläneestä baijerilaisesta abbedissa Valburgista. Vappua on juhlittu keskiajalta lähtien - myös Suomessa - 1. toukokuuta, joka on Valburgin pyhimykseksi julistamisen päivä. Sen mukaisesti päivä on myös Vapun ja Valpurin nimipäivä. Nykyään päivä ei ole kirkollinen juhlapäivä, vaikka onkin yleinen vapaapäivä, mutta aikoinaan samaksi päiväksi sattui myös apostolien Filippuksen ja Jaakobin muistopäivä."},{"date":"2023-05-18","name":"Helatorstai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0055","description":"Helatorstai on vuotuinen kristillinen juhla, jota vietetään neljäntenäkymmenentenä päivänä pääsiäisestä Jeesuksen taivaaseenastumisen muistoksi.\n\nUseimmissa kielissä päivän nimi viittaa suoraan juhlan aiheeseen, Kristuksen taivaaseenastumiseen. Suomen kielessä sillä on kuitenkin perinteinen, alkujaan ruotsista lainattu nimi, jonka alkuosa hela viittaa ruotsin kielen pyhää tarkoittavaan sanaan helg."},{"date":"2023-05-21","name":"Kaatuneiden muistopäivä","flag_day":1,"age":83,"url":"https:\/\/fi.wikipedia.org\/wiki\/Kaatuneiden_muistop%C3%A4iv%C3%A4","description":"Kaatuneiden muistopäivä on sodassa kaatuneiden vainajien muistoksi järjestetty päivä. Järjestelyihin kuuluu valtakunnallinen pääjuhla, paikallisia muistotilaisuuksia jumalanpalveluksineen ja sankarihaudoilla käynteineen. Nykyisin muistopäivänä kunnioitetaan itsenäisen Suomen kaikkien sotien kaikkia vainajia."},{"date":"2023-05-28","name":"Helluntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0058","description":"Helluntai on Pyhän Hengen vuodattamiselle omistettu kristillinen juhlapäivä. Helluntaita vietetään seitsemän viikon kuluttua pääsiäisestä ja kymmenen päivää helatorstain jälkeen. Suomen kieleen sana helluntai on tullut ruotsin kielen sanoista helig dag, pyhä päivä.\n\nAlkuperältään ja ajankohdaltaan helluntai liittyy myös juutalaisten shavuot-juhlaan eli viikkojuhlaan, jota vietetään seitsemän viikkoa juutalaisten pääsiäisen eli pesahin jälkeen toisaalta sadonkorjuu­juhlana, toisaalta Siinailla tapahtuneen lain antamisen muisto­juhlana.\n\nSuomessa helluntai on kirkkolain mukainen kirkollinen juhlapäivä. Kaupat pidetään silloin eräin poikkeuksin laki­sääteisesti kiinni."},{"date":"2023-06-04","name":"Pyhän Kolminaisuuden päivä","alternate_names":"1. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0060","description":"Pyhän Kolminaisuuden päivä on kristillinen juhlapäivä, jota vietetään ensimmäisenä sunnuntaina helluntain jälkeen. Sen vietto sai alkunsa Englannissa 1000-luvulla. Päivä on omistettu Pyhälle Kolminaisuudelle. Pyhän kolminaisuuden päivän liturginen väri on valkoinen."},{"date":"2023-06-24","name":"Juhannus","flag_day":1,"alternate_names":"Johannes Kastajan päivä; Suomen lipun päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Juhannus","description":"Juhannus on suomalainen nimi keskikesän juhlalle, jota vietetään kesäkuussa kesäpäivänseisauksen lähellä. Pohjoisessa juhannus on valon juhla, jolloin keskikesä on kauneimmillaan.\n\nSuomalaiseen juhannukseen kuuluvat kiinteästi juhannussauna, juhannuskokko, juhannustanssit ja muut juhlat. Suomessa juhannus on myös virallinen liputuspäivä, jolloin liputetaan koko juhannusyön ajan. Monet juhannuksen perinteistä juontavat juurensa vanhaan eurooppalaiseen valon ja hedelmällisyyden juhlaan kesäpäivänseisauksen aikana.\n\nSuomessa ja Ruotsissa juhannus on ollut tärkeä kansanomainen merkkipäivä. Juhannukseen on vanhastaan liittynyt erilaisia uskomuksia ja taikoja, joilla on pyritty varmistamaan tuleva sato ja naimaonni. Monet kristilliset kirkkokunnat viettävät juhannusta Johannes Kastajan muistopäivänä, mistä tulee nimi juhannus.\n\nJuhannus on virallinen liputuspäivä, Suomen lipun päivä. Muista liputuspäivistä poiketen silloin liputus alkaa jo aattoiltana kello 18 ja jatkuu yön yli yhtäjaksoisesti juhannuspäivän iltaan kello 21 saakka."},{"date":"2023-07-09","name":"Apostolien päivä","alternate_names":"6. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0065","description":"Apostolien päivää on vietetty Pietarin ja Paavalin marttyyrikuolemiensa muistoksi Keskiajalla, mutta nykyään Apostolien päivänä muistellaan kaikki apostoleja. Liturginen väri on punainen ja alttarikynttilöitä on neljä."},{"date":"2023-07-23","name":"Kirkastussunnuntai","alternate_names":"8. sunnuntai helluntaista; Kristuksen kirkastumisen päivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0067","description":"Kirkastussunnuntai on Suomen evankelis-luterilaisen kirkon kirkkovuodessa nimitys seitsemännelle kolminaisuudenpäivän jälkeiselle sunnuntaille eli kahdeksannelle sunnuntaille helluntaista. Päivää vietetään Kristuksen kirkastumisen muistoksi."},{"date":"2023-10-01","name":"Mikkelinpäivä","alternate_names":"Enkelien sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0091","description":"Mikkelinpäivä on alun perin arkkienkeli Mikaelin, mutta nykyisin päivä on omistettu kaikille enkeleille."},{"date":"2023-11-04","name":"Pyhäinpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0092","description":"Pyhäinpäivä on kristillinen pyhimysten, marttyyrien ja vainajien muistopäivä\n\nNykyinen suomalainen pyhäinpäivä on yhdistelmä kahdesta varsinkin katolisen kirkon keskiajalta lähtien viettämästä juhlasta, jotka ovat kaikkien pyhien päivä 1. marraskuuta ja kaikkien uskovien vainajien muistopäivä 2. marraskuuta. Suomessa siitä on tullut yleinen vainajien muistopäivä. Silloin monet vievät läheisten haudalle esimerkiksi kynttilän tai kukkia kuolleiden muistoksi. Kotona voidaan myös sytyttää kynttilä läheisen muistoksi.\n\nVanhoista ajoista on Suomessa vietetty syksyllä sadonkorjuun päättymisen jälkeen kekriä. Koska se ajankohdaltaan sattui lähelle kristillistä pyhäinpäivää, se on myöhempinä aikoina usein samastettukin pyhäinpäivän kanssa, josta kansanomaisesti onkin käytetty myös nimitystä kekri."},{"date":"2023-11-26","name":"Tuomiosunnuntai","alternate_names":"Kristuksen kuninkuuden sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0087","description":"Tuomiosunnuntai kirkkovuoden viimeinen sunnuntai. Sen nimi vaihtelee eri kirkkokunnissa, Suomessa se on Ruotsin mallin mukaan 'tuomiosunnuntai'. Tuomiosunnuntain liturginen väri on vihreä.\n\nTuomiosunnuntain sanoma liittyy Kristuksen toiseen tulemukseen, nyt kuninkaana ja vanhurskaana tuomarina."},{"date":"2023-12-06","name":"Suomen itsenäisyyspäivä","flag_day":1,"age":106,"url":"https:\/\/fi.wikipedia.org\/wiki\/Suomen_itsen%C3%A4isyysp%C3%A4iv%C3%A4","description":"Suomen itsenäisyyspäivä on Suomen kansallispäivä, jota vietetään 6. joulukuuta 1917 tapahtuneen itsenäistymisen kunniaksi. Itsenäisen Suomea edelsi Suomen suuriruhtinaskunta, joka oli itsehallinnollinen osa Venäjän keisarikuntaa.\n\nJoulukuun 6. päivää on vietetty itsenäisyyspäivänä vuodesta 1919 lähtien. Asiasta päätti Valtioneuvosto, ja päivästä tuli vapaapäivä valtion virastoissa, kouluissa ja tuomioistuimissa. Vuonna 1929 säädettiin lailla yleiseksi palkalliseksi vapaapäiväksi. Vuonna 1937 säädettiin laki itsenäisyyspäivän viettämisestä yleisenä juhla- ja vapaapäivänä. Sen mukaan päivä itsenäisyyspäivän tuli olla palkallinen vapaapäivä, tai missä se ei ole mahdollista, on maksettava korotettua palkkaa kuten sunnuntaityöstä.\n\nItsenäisyyspäivä on myös virallinen liputuspäivä. Silloin liputus päättyy muista liputuspäivistä poikkeavasti klo 20."},{"date":"2023-12-25","name":"Joulupäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0009","description":"Joulua vietetään Jeesuksen syntymän muistoksi. Joulun vietto alkaa Suomessa yleensä jo aattoiltana, joulukuun 25. päivä on kuitenkin varsinainen joulupäivä.\n\nJoulun ajankohta on muinaisen roomalaisen kalenterin talvipäivänseisauksen päivämäärä. Suomen kielen sana joulu ja juhla ovat ruotsalaisia tai skandinaavisia lainasanoja. Sana joulu tulee alun perin ennen kristinuskoa vietetyn talvipäivänseisauksen juhlan muinaisgermaanisesta nimestä. Joulussa ovat yhdistyneet kristillinen juhla, muinainen roomalainen saturnalia-juhla sekä Euroopan pohjoisten kansojen maatalousvuoden päättäjäis- ja keskitalven juhla (yule), Suomessa vanha vuodenvaihteenjuhla kekri. Joulu on yleinen perhejuhla eri puolilla maailmaa."},{"date":"2023-12-26","name":"Tapaninpäivä","alternate_names":"2. joulupäivä; marttyyri Stefanoksen ja kaikkien marttyyrien muistopäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0010","description":"Tapaninpäivä eli toinen joulupäivä on joulunseudun kirkkopyhä, ensimmäisen marttyyrin Stefanoksen ja hänen myötään kaikkien marttyyrien muistopäivä. Tapaninpäivä on aina ollut myös hevosten ja hevosmiesten päivä.\n\nTapaninpäivän perinteisiin kuuluu tapaninajelu, mieluiten hevosella. Hevosia opetettiin juoksemaan ja ajeltiin kylillä hupailemassa. Iloiset rekiretket tehtiin joukolla ja joulun hiljaisen hartaan tunnelman jälkeen nuoriso ja vanhempikin väki huristeli innoissaan kylänraitteja. Myös tapaninkulkueita, laulajia, jouluämmiä ja -äijiä liikkui eri puolilla kyliä."},{"date":"2024-01-01","name":"Uudenvuodenpäivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Uudenvuodenp%C3%A4iv%C3%A4","description":"Uusivuosi on juhla, jolla juhlistetaan vuoden vaihtumista, kun vanhan vuoden viimeinen päivä (uudenvuodenaatto) vaihtuu uuden vuoden ensimmäiseksi päiväksi (uudenvuodenpäivä). Uuttavuotta juhlitaan ympäri maailmaa eri tavoin. Uuden vuoden alkaessa on tapana muistella menneen vuoden tapahtumia sekä tehdä suunnitelmia alkavan vuoden varalle."},{"date":"2024-01-06","name":"Loppiainen","alternate_names":"Epifania; Teofania","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0017","description":"Loppiainen on kristillinen juhlapäivä, joka päättää joulun pyhät. Sitä nimitetään myös Jumalan ilmestymisen juhlaksi, ja se on todennäköisesti joulua vanhempi kristillinen juhla. Vaikka loppiainen suomen kielessä viittaa nimelläänkin jouluajan loppumiseen, suomalaisessa kansanperinteessä joulunajan on kuitenkin yleisesti katsottu jatkuvan sen jälkeenkin Nuutin päivään saakka.\n\nKatolisessa ja luterilaisessa kirkossa loppiaista vietetään itämaan tietäjien Betlehemiin saapumisen muistopäivänä. Monissa maissa sitä nimitetäänkin kolmen kuninkaan juhlaksi. Se on omistettu myös lähetystyölle."},{"date":"2024-02-04","name":"Kynttilänpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0088","description":"Kynttilänpäivä (kynttilämessu, ortodokseilla Herran temppeliintuominen) on kristillinen juhlapäivä, jota vietetään alkujaan 40 päivää joulusta sen muistoksi, että Jeesus vietiin 40 päivän ikäisenä temppeliin ja Simeon siunasi hänet.\n\nTapahtuman taustalla on kertomus vapautumisesta Egyptin orjuudesta ja juutalainen pääsiäinen. Sen mukaan jokainen esikoinen kuuluu Jumalalle, ja hänet lunastetaan Jumalalta. Taustalla ovat myös synnyttämiseen kuuluvat puhtaussäännökset."},{"date":"2024-02-11","name":"Laskiaissunnuntai","alternate_names":"Esto mihi; Quinquagesima; sovintosunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0026","description":"Laskiainen on katolisen kirkon kirkon kevätpaaston alkajaisjuhla. Suomessa sanaa käytetään nykyisin laskiaistiistaista.\n\nLaskiaista vietetään seitsemän viikkoa ennen pääsiäistä. Siihen kuuluvia juhlapäiviä ovat laskiaissunnuntai sekä kaksi päivää myöhemmin oleva laskiaistiistai, useissa maissa myös niiden välinen maanantai, joka esimerkiksi Saksassa tunnetaan nimellä Rosenmontag (\"ruusumaanantai\"). Laskiaisen jälkeen alka paastonaika, joka loppuu vasta pääsiäisenä. Oleellista paastonajalle oli liharuokien pois jättäminen ruokavaliosta, johon myös useat laskiaiseen liittyvät termit viittaavat. Laskiaistiistain jälkeinen tuhkakeskiviikko aloittaa 40 päivää kestävä paastoamisen."},{"date":"2024-03-17","name":"Marian ilmestyspäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0089","description":"Marian ilmestyspäivä eli marianpäivä on kristillinen juhlapäivä, joka juhlistaa arkkienkeli Gabrielin ilmestymistä Neitsyt Marialle ilmoittamaan Kristuksen tulevasta syntymästä. Tapauksesta kerrotaan Luukkaan evankeliumin ensimmäisessä luvussa.\n\nMarian ilmestyspäivän liturginen väri on valkoinen, Marian ilmestyspäivää edeltävän viikon värinä on sininen tai violetti."},{"date":"2024-03-24","name":"Palmusunnuntai","alternate_names":"virposunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0033","description":"Palmusunnuntai on kristillisen kirkkovuoden juhla, joka on viikkoa ennen pääsiäissunnuntaita. Palmusunnuntai aloittaa niin sanotun hiljaisen viikon, jolloin muistellaan Jeesuksen kärsimyksiä.\n\nPalmusunnuntaita vietetään sen tapauksen muistoksi, kun Jeesus saapui aasilla ratsastaen Jerusalemiin. Tapauksesta kerrotaan kaikissa evankeliumeissa. Palmusunnuntai on saanut nimensä palmunlehvistä, joita kansa levitti vaatteiden ohella Jeesuksen eteen. Ihmiset huusivat ja lauloivat \"Hoosianna\". Hoosianna on suoraan käännettynä \"oi, auta\", \"oi, pelasta\", mutta ajanlaskun alun aikoihin sitä käytettiin riemuhuutona.\n\nPohjoisessa ainoa elävä oksa pääsiäisen aikaan on paju, ja päivä tunnetaan myös virpa- tai virpomasunnuntain nimellä. Vanhastaan Karjalassa, nykyisin yleisesti koko Suomessa päivän perinteisiin kuuluu virpominen."},{"date":"2024-03-29","name":"Pitkäperjantai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0038","description":"Pitkäperjantai on pääsiäistä edeltävä perjantai. Se on Kristuksen ristiinnaulitsemis- ja kuolinpäivä ja kirkkovuoden ainoa surujuhla. Pitkäperjantai on yksi Suuren viikon juhlapyhistä.\n\nLuterilaisessa kirkossa pitkänperjantain jumalanpalvelusta vietetään ilman ehtoollista ja kellon- ja urkujensoittoa. Kello 15 voidaan viettää Jeesuksen kuolinhetken muistoa. Pitkänperjantain iltajumalanpalvelus taas on perinteisesti omistettu Jeesuksen hautaamiselle. Pitkäperjantai ja hiljainen lauantai ovat ainoat kirkkovuoden päivät, jolloin liturginen väri on musta."},{"date":"2024-03-31","name":"Pääsiäissunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0043","description":"Pääsiäinen on kristinuskon vuotuisjuhla, jota vietetään Jeesuksen ylösnousemuksen juhlana. Ylösnousemus on kristillisen uskon ydinkohtia, ja pääsiäinen kirkkovuoden vanhin ja tärkein juhla. Pääsiäistä edeltää hiljainen viikko, joka huipentuu pitkäperjantaihin, Jeesuksen ristiinnaulitsemisen päivään.\n\nPääsiäiseen liittyy useita keväisen luonnon heräävän elämän vertauskuvia. Näitä ovat muun muassa narsissit, rairuoho, keltaiset pääsiäistiput sekä kanit eli puput. Uutta elämää kuvaavat myös hiirenkorvalle puhkeavat koivunoksat ja pajunkissat. Muna on eri puolilla maailmaa tunnettu hedelmällisyyden ja kasvun vertauskuva."},{"date":"2024-04-01","name":"Toinen pääsiäispäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0044","description":"Toinen pääsiäispäivä on pääsiäispäivää seuraava maanantai. Päivänä muistetaan ylösnousseen Jeesuksen ilmestymistä opetuslapsille ja muutamille naisille. Ilmestykset vakuuttivat heidät hänen kuolleista nousemisestaan ja jatkuvasta läsnäolostaan. Teemana \"seurakunta elää Ylösnousseen seurassa\"."},{"date":"2024-05-01","name":"Vappu","flag_day":1,"alternate_names":"suomalaisen työn päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Vappu","description":"Vappu on kansainvälinen juhlapäivä ja monissa maissa yleinen vapaapäivä. Se on alkavan kevään juhlapäivä sekä kansainvälinen työväen juhlapäivä. Suomessa vapunpäivää aattopäivineen vietetään työväen, ylioppilaiden ja kevään karnevaalijuhlana. Vuodesta 1979 lähtien vappu on ollut Suomessa virallinen liputuspäivä, suomalaisen työn päivä.\n\nNimi vappu tulee 700-luvulla eläneestä baijerilaisesta abbedissa Valburgista. Vappua on juhlittu keskiajalta lähtien - myös Suomessa - 1. toukokuuta, joka on Valburgin pyhimykseksi julistamisen päivä. Sen mukaisesti päivä on myös Vapun ja Valpurin nimipäivä. Nykyään päivä ei ole kirkollinen juhlapäivä, vaikka onkin yleinen vapaapäivä, mutta aikoinaan samaksi päiväksi sattui myös apostolien Filippuksen ja Jaakobin muistopäivä."},{"date":"2024-05-09","name":"Helatorstai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0055","description":"Helatorstai on vuotuinen kristillinen juhla, jota vietetään neljäntenäkymmenentenä päivänä pääsiäisestä Jeesuksen taivaaseenastumisen muistoksi.\n\nUseimmissa kielissä päivän nimi viittaa suoraan juhlan aiheeseen, Kristuksen taivaaseenastumiseen. Suomen kielessä sillä on kuitenkin perinteinen, alkujaan ruotsista lainattu nimi, jonka alkuosa hela viittaa ruotsin kielen pyhää tarkoittavaan sanaan helg."},{"date":"2024-05-19","name":"Helluntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0058","description":"Helluntai on Pyhän Hengen vuodattamiselle omistettu kristillinen juhlapäivä. Helluntaita vietetään seitsemän viikon kuluttua pääsiäisestä ja kymmenen päivää helatorstain jälkeen. Suomen kieleen sana helluntai on tullut ruotsin kielen sanoista helig dag, pyhä päivä.\n\nAlkuperältään ja ajankohdaltaan helluntai liittyy myös juutalaisten shavuot-juhlaan eli viikkojuhlaan, jota vietetään seitsemän viikkoa juutalaisten pääsiäisen eli pesahin jälkeen toisaalta sadonkorjuu­juhlana, toisaalta Siinailla tapahtuneen lain antamisen muisto­juhlana.\n\nSuomessa helluntai on kirkkolain mukainen kirkollinen juhlapäivä. Kaupat pidetään silloin eräin poikkeuksin laki­sääteisesti kiinni."},{"date":"2024-05-19","name":"Kaatuneiden muistopäivä","flag_day":1,"age":84,"url":"https:\/\/fi.wikipedia.org\/wiki\/Kaatuneiden_muistop%C3%A4iv%C3%A4","description":"Kaatuneiden muistopäivä on sodassa kaatuneiden vainajien muistoksi järjestetty päivä. Järjestelyihin kuuluu valtakunnallinen pääjuhla, paikallisia muistotilaisuuksia jumalanpalveluksineen ja sankarihaudoilla käynteineen. Nykyisin muistopäivänä kunnioitetaan itsenäisen Suomen kaikkien sotien kaikkia vainajia."},{"date":"2024-05-26","name":"Pyhän Kolminaisuuden päivä","alternate_names":"1. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0060","description":"Pyhän Kolminaisuuden päivä on kristillinen juhlapäivä, jota vietetään ensimmäisenä sunnuntaina helluntain jälkeen. Sen vietto sai alkunsa Englannissa 1000-luvulla. Päivä on omistettu Pyhälle Kolminaisuudelle. Pyhän kolminaisuuden päivän liturginen väri on valkoinen."},{"date":"2024-06-22","name":"Juhannus","flag_day":1,"alternate_names":"Johannes Kastajan päivä; Suomen lipun päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Juhannus","description":"Juhannus on suomalainen nimi keskikesän juhlalle, jota vietetään kesäkuussa kesäpäivänseisauksen lähellä. Pohjoisessa juhannus on valon juhla, jolloin keskikesä on kauneimmillaan.\n\nSuomalaiseen juhannukseen kuuluvat kiinteästi juhannussauna, juhannuskokko, juhannustanssit ja muut juhlat. Suomessa juhannus on myös virallinen liputuspäivä, jolloin liputetaan koko juhannusyön ajan. Monet juhannuksen perinteistä juontavat juurensa vanhaan eurooppalaiseen valon ja hedelmällisyyden juhlaan kesäpäivänseisauksen aikana.\n\nSuomessa ja Ruotsissa juhannus on ollut tärkeä kansanomainen merkkipäivä. Juhannukseen on vanhastaan liittynyt erilaisia uskomuksia ja taikoja, joilla on pyritty varmistamaan tuleva sato ja naimaonni. Monet kristilliset kirkkokunnat viettävät juhannusta Johannes Kastajan muistopäivänä, mistä tulee nimi juhannus.\n\nJuhannus on virallinen liputuspäivä, Suomen lipun päivä. Muista liputuspäivistä poiketen silloin liputus alkaa jo aattoiltana kello 18 ja jatkuu yön yli yhtäjaksoisesti juhannuspäivän iltaan kello 21 saakka."},{"date":"2024-06-30","name":"Apostolien päivä","alternate_names":"6. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0065","description":"Apostolien päivää on vietetty Pietarin ja Paavalin marttyyrikuolemiensa muistoksi Keskiajalla, mutta nykyään Apostolien päivänä muistellaan kaikki apostoleja. Liturginen väri on punainen ja alttarikynttilöitä on neljä."},{"date":"2024-07-14","name":"Kirkastussunnuntai","alternate_names":"8. sunnuntai helluntaista; Kristuksen kirkastumisen päivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0067","description":"Kirkastussunnuntai on Suomen evankelis-luterilaisen kirkon kirkkovuodessa nimitys seitsemännelle kolminaisuudenpäivän jälkeiselle sunnuntaille eli kahdeksannelle sunnuntaille helluntaista. Päivää vietetään Kristuksen kirkastumisen muistoksi."},{"date":"2024-09-29","name":"Mikkelinpäivä","alternate_names":"Enkelien sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0091","description":"Mikkelinpäivä on alun perin arkkienkeli Mikaelin, mutta nykyisin päivä on omistettu kaikille enkeleille."},{"date":"2024-11-02","name":"Pyhäinpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0092","description":"Pyhäinpäivä on kristillinen pyhimysten, marttyyrien ja vainajien muistopäivä\n\nNykyinen suomalainen pyhäinpäivä on yhdistelmä kahdesta varsinkin katolisen kirkon keskiajalta lähtien viettämästä juhlasta, jotka ovat kaikkien pyhien päivä 1. marraskuuta ja kaikkien uskovien vainajien muistopäivä 2. marraskuuta. Suomessa siitä on tullut yleinen vainajien muistopäivä. Silloin monet vievät läheisten haudalle esimerkiksi kynttilän tai kukkia kuolleiden muistoksi. Kotona voidaan myös sytyttää kynttilä läheisen muistoksi.\n\nVanhoista ajoista on Suomessa vietetty syksyllä sadonkorjuun päättymisen jälkeen kekriä. Koska se ajankohdaltaan sattui lähelle kristillistä pyhäinpäivää, se on myöhempinä aikoina usein samastettukin pyhäinpäivän kanssa, josta kansanomaisesti onkin käytetty myös nimitystä kekri."},{"date":"2024-11-24","name":"Tuomiosunnuntai","alternate_names":"Kristuksen kuninkuuden sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0087","description":"Tuomiosunnuntai kirkkovuoden viimeinen sunnuntai. Sen nimi vaihtelee eri kirkkokunnissa, Suomessa se on Ruotsin mallin mukaan 'tuomiosunnuntai'. Tuomiosunnuntain liturginen väri on vihreä.\n\nTuomiosunnuntain sanoma liittyy Kristuksen toiseen tulemukseen, nyt kuninkaana ja vanhurskaana tuomarina."},{"date":"2024-12-06","name":"Suomen itsenäisyyspäivä","flag_day":1,"age":107,"url":"https:\/\/fi.wikipedia.org\/wiki\/Suomen_itsen%C3%A4isyysp%C3%A4iv%C3%A4","description":"Suomen itsenäisyyspäivä on Suomen kansallispäivä, jota vietetään 6. joulukuuta 1917 tapahtuneen itsenäistymisen kunniaksi. Itsenäisen Suomea edelsi Suomen suuriruhtinaskunta, joka oli itsehallinnollinen osa Venäjän keisarikuntaa.\n\nJoulukuun 6. päivää on vietetty itsenäisyyspäivänä vuodesta 1919 lähtien. Asiasta päätti Valtioneuvosto, ja päivästä tuli vapaapäivä valtion virastoissa, kouluissa ja tuomioistuimissa. Vuonna 1929 säädettiin lailla yleiseksi palkalliseksi vapaapäiväksi. Vuonna 1937 säädettiin laki itsenäisyyspäivän viettämisestä yleisenä juhla- ja vapaapäivänä. Sen mukaan päivä itsenäisyyspäivän tuli olla palkallinen vapaapäivä, tai missä se ei ole mahdollista, on maksettava korotettua palkkaa kuten sunnuntaityöstä.\n\nItsenäisyyspäivä on myös virallinen liputuspäivä. Silloin liputus päättyy muista liputuspäivistä poikkeavasti klo 20."},{"date":"2024-12-25","name":"Joulupäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0009","description":"Joulua vietetään Jeesuksen syntymän muistoksi. Joulun vietto alkaa Suomessa yleensä jo aattoiltana, joulukuun 25. päivä on kuitenkin varsinainen joulupäivä.\n\nJoulun ajankohta on muinaisen roomalaisen kalenterin talvipäivänseisauksen päivämäärä. Suomen kielen sana joulu ja juhla ovat ruotsalaisia tai skandinaavisia lainasanoja. Sana joulu tulee alun perin ennen kristinuskoa vietetyn talvipäivänseisauksen juhlan muinaisgermaanisesta nimestä. Joulussa ovat yhdistyneet kristillinen juhla, muinainen roomalainen saturnalia-juhla sekä Euroopan pohjoisten kansojen maatalousvuoden päättäjäis- ja keskitalven juhla (yule), Suomessa vanha vuodenvaihteenjuhla kekri. Joulu on yleinen perhejuhla eri puolilla maailmaa."},{"date":"2024-12-26","name":"Tapaninpäivä","alternate_names":"2. joulupäivä; marttyyri Stefanoksen ja kaikkien marttyyrien muistopäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0010","description":"Tapaninpäivä eli toinen joulupäivä on joulunseudun kirkkopyhä, ensimmäisen marttyyrin Stefanoksen ja hänen myötään kaikkien marttyyrien muistopäivä. Tapaninpäivä on aina ollut myös hevosten ja hevosmiesten päivä.\n\nTapaninpäivän perinteisiin kuuluu tapaninajelu, mieluiten hevosella. Hevosia opetettiin juoksemaan ja ajeltiin kylillä hupailemassa. Iloiset rekiretket tehtiin joukolla ja joulun hiljaisen hartaan tunnelman jälkeen nuoriso ja vanhempikin väki huristeli innoissaan kylänraitteja. Myös tapaninkulkueita, laulajia, jouluämmiä ja -äijiä liikkui eri puolilla kyliä."},{"date":"2025-01-01","name":"Uudenvuodenpäivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Uudenvuodenp%C3%A4iv%C3%A4","description":"Uusivuosi on juhla, jolla juhlistetaan vuoden vaihtumista, kun vanhan vuoden viimeinen päivä (uudenvuodenaatto) vaihtuu uuden vuoden ensimmäiseksi päiväksi (uudenvuodenpäivä). Uuttavuotta juhlitaan ympäri maailmaa eri tavoin. Uuden vuoden alkaessa on tapana muistella menneen vuoden tapahtumia sekä tehdä suunnitelmia alkavan vuoden varalle."},{"date":"2025-01-06","name":"Loppiainen","alternate_names":"Epifania; Teofania","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0017","description":"Loppiainen on kristillinen juhlapäivä, joka päättää joulun pyhät. Sitä nimitetään myös Jumalan ilmestymisen juhlaksi, ja se on todennäköisesti joulua vanhempi kristillinen juhla. Vaikka loppiainen suomen kielessä viittaa nimelläänkin jouluajan loppumiseen, suomalaisessa kansanperinteessä joulunajan on kuitenkin yleisesti katsottu jatkuvan sen jälkeenkin Nuutin päivään saakka.\n\nKatolisessa ja luterilaisessa kirkossa loppiaista vietetään itämaan tietäjien Betlehemiin saapumisen muistopäivänä. Monissa maissa sitä nimitetäänkin kolmen kuninkaan juhlaksi. Se on omistettu myös lähetystyölle."},{"date":"2025-02-02","name":"Kynttilänpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0088","description":"Kynttilänpäivä (kynttilämessu, ortodokseilla Herran temppeliintuominen) on kristillinen juhlapäivä, jota vietetään alkujaan 40 päivää joulusta sen muistoksi, että Jeesus vietiin 40 päivän ikäisenä temppeliin ja Simeon siunasi hänet.\n\nTapahtuman taustalla on kertomus vapautumisesta Egyptin orjuudesta ja juutalainen pääsiäinen. Sen mukaan jokainen esikoinen kuuluu Jumalalle, ja hänet lunastetaan Jumalalta. Taustalla ovat myös synnyttämiseen kuuluvat puhtaussäännökset."},{"date":"2025-03-02","name":"Laskiaissunnuntai","alternate_names":"Esto mihi; Quinquagesima; sovintosunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0026","description":"Laskiainen on katolisen kirkon kirkon kevätpaaston alkajaisjuhla. Suomessa sanaa käytetään nykyisin laskiaistiistaista.\n\nLaskiaista vietetään seitsemän viikkoa ennen pääsiäistä. Siihen kuuluvia juhlapäiviä ovat laskiaissunnuntai sekä kaksi päivää myöhemmin oleva laskiaistiistai, useissa maissa myös niiden välinen maanantai, joka esimerkiksi Saksassa tunnetaan nimellä Rosenmontag (\"ruusumaanantai\"). Laskiaisen jälkeen alka paastonaika, joka loppuu vasta pääsiäisenä. Oleellista paastonajalle oli liharuokien pois jättäminen ruokavaliosta, johon myös useat laskiaiseen liittyvät termit viittaavat. Laskiaistiistain jälkeinen tuhkakeskiviikko aloittaa 40 päivää kestävä paastoamisen."},{"date":"2025-03-23","name":"Marian ilmestyspäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0089","description":"Marian ilmestyspäivä eli marianpäivä on kristillinen juhlapäivä, joka juhlistaa arkkienkeli Gabrielin ilmestymistä Neitsyt Marialle ilmoittamaan Kristuksen tulevasta syntymästä. Tapauksesta kerrotaan Luukkaan evankeliumin ensimmäisessä luvussa.\n\nMarian ilmestyspäivän liturginen väri on valkoinen, Marian ilmestyspäivää edeltävän viikon värinä on sininen tai violetti."},{"date":"2025-04-13","name":"Palmusunnuntai","alternate_names":"virposunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0033","description":"Palmusunnuntai on kristillisen kirkkovuoden juhla, joka on viikkoa ennen pääsiäissunnuntaita. Palmusunnuntai aloittaa niin sanotun hiljaisen viikon, jolloin muistellaan Jeesuksen kärsimyksiä.\n\nPalmusunnuntaita vietetään sen tapauksen muistoksi, kun Jeesus saapui aasilla ratsastaen Jerusalemiin. Tapauksesta kerrotaan kaikissa evankeliumeissa. Palmusunnuntai on saanut nimensä palmunlehvistä, joita kansa levitti vaatteiden ohella Jeesuksen eteen. Ihmiset huusivat ja lauloivat \"Hoosianna\". Hoosianna on suoraan käännettynä \"oi, auta\", \"oi, pelasta\", mutta ajanlaskun alun aikoihin sitä käytettiin riemuhuutona.\n\nPohjoisessa ainoa elävä oksa pääsiäisen aikaan on paju, ja päivä tunnetaan myös virpa- tai virpomasunnuntain nimellä. Vanhastaan Karjalassa, nykyisin yleisesti koko Suomessa päivän perinteisiin kuuluu virpominen."},{"date":"2025-04-18","name":"Pitkäperjantai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0038","description":"Pitkäperjantai on pääsiäistä edeltävä perjantai. Se on Kristuksen ristiinnaulitsemis- ja kuolinpäivä ja kirkkovuoden ainoa surujuhla. Pitkäperjantai on yksi Suuren viikon juhlapyhistä.\n\nLuterilaisessa kirkossa pitkänperjantain jumalanpalvelusta vietetään ilman ehtoollista ja kellon- ja urkujensoittoa. Kello 15 voidaan viettää Jeesuksen kuolinhetken muistoa. Pitkänperjantain iltajumalanpalvelus taas on perinteisesti omistettu Jeesuksen hautaamiselle. Pitkäperjantai ja hiljainen lauantai ovat ainoat kirkkovuoden päivät, jolloin liturginen väri on musta."},{"date":"2025-04-20","name":"Pääsiäissunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0043","description":"Pääsiäinen on kristinuskon vuotuisjuhla, jota vietetään Jeesuksen ylösnousemuksen juhlana. Ylösnousemus on kristillisen uskon ydinkohtia, ja pääsiäinen kirkkovuoden vanhin ja tärkein juhla. Pääsiäistä edeltää hiljainen viikko, joka huipentuu pitkäperjantaihin, Jeesuksen ristiinnaulitsemisen päivään.\n\nPääsiäiseen liittyy useita keväisen luonnon heräävän elämän vertauskuvia. Näitä ovat muun muassa narsissit, rairuoho, keltaiset pääsiäistiput sekä kanit eli puput. Uutta elämää kuvaavat myös hiirenkorvalle puhkeavat koivunoksat ja pajunkissat. Muna on eri puolilla maailmaa tunnettu hedelmällisyyden ja kasvun vertauskuva."},{"date":"2025-04-21","name":"Toinen pääsiäispäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0044","description":"Toinen pääsiäispäivä on pääsiäispäivää seuraava maanantai. Päivänä muistetaan ylösnousseen Jeesuksen ilmestymistä opetuslapsille ja muutamille naisille. Ilmestykset vakuuttivat heidät hänen kuolleista nousemisestaan ja jatkuvasta läsnäolostaan. Teemana \"seurakunta elää Ylösnousseen seurassa\"."},{"date":"2025-05-01","name":"Vappu","flag_day":1,"alternate_names":"suomalaisen työn päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Vappu","description":"Vappu on kansainvälinen juhlapäivä ja monissa maissa yleinen vapaapäivä. Se on alkavan kevään juhlapäivä sekä kansainvälinen työväen juhlapäivä. Suomessa vapunpäivää aattopäivineen vietetään työväen, ylioppilaiden ja kevään karnevaalijuhlana. Vuodesta 1979 lähtien vappu on ollut Suomessa virallinen liputuspäivä, suomalaisen työn päivä.\n\nNimi vappu tulee 700-luvulla eläneestä baijerilaisesta abbedissa Valburgista. Vappua on juhlittu keskiajalta lähtien - myös Suomessa - 1. toukokuuta, joka on Valburgin pyhimykseksi julistamisen päivä. Sen mukaisesti päivä on myös Vapun ja Valpurin nimipäivä. Nykyään päivä ei ole kirkollinen juhlapäivä, vaikka onkin yleinen vapaapäivä, mutta aikoinaan samaksi päiväksi sattui myös apostolien Filippuksen ja Jaakobin muistopäivä."},{"date":"2025-05-18","name":"Kaatuneiden muistopäivä","flag_day":1,"age":85,"url":"https:\/\/fi.wikipedia.org\/wiki\/Kaatuneiden_muistop%C3%A4iv%C3%A4","description":"Kaatuneiden muistopäivä on sodassa kaatuneiden vainajien muistoksi järjestetty päivä. Järjestelyihin kuuluu valtakunnallinen pääjuhla, paikallisia muistotilaisuuksia jumalanpalveluksineen ja sankarihaudoilla käynteineen. Nykyisin muistopäivänä kunnioitetaan itsenäisen Suomen kaikkien sotien kaikkia vainajia."},{"date":"2025-05-29","name":"Helatorstai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0055","description":"Helatorstai on vuotuinen kristillinen juhla, jota vietetään neljäntenäkymmenentenä päivänä pääsiäisestä Jeesuksen taivaaseenastumisen muistoksi.\n\nUseimmissa kielissä päivän nimi viittaa suoraan juhlan aiheeseen, Kristuksen taivaaseenastumiseen. Suomen kielessä sillä on kuitenkin perinteinen, alkujaan ruotsista lainattu nimi, jonka alkuosa hela viittaa ruotsin kielen pyhää tarkoittavaan sanaan helg."},{"date":"2025-06-08","name":"Helluntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0058","description":"Helluntai on Pyhän Hengen vuodattamiselle omistettu kristillinen juhlapäivä. Helluntaita vietetään seitsemän viikon kuluttua pääsiäisestä ja kymmenen päivää helatorstain jälkeen. Suomen kieleen sana helluntai on tullut ruotsin kielen sanoista helig dag, pyhä päivä.\n\nAlkuperältään ja ajankohdaltaan helluntai liittyy myös juutalaisten shavuot-juhlaan eli viikkojuhlaan, jota vietetään seitsemän viikkoa juutalaisten pääsiäisen eli pesahin jälkeen toisaalta sadonkorjuu­juhlana, toisaalta Siinailla tapahtuneen lain antamisen muisto­juhlana.\n\nSuomessa helluntai on kirkkolain mukainen kirkollinen juhlapäivä. Kaupat pidetään silloin eräin poikkeuksin laki­sääteisesti kiinni."},{"date":"2025-06-15","name":"Pyhän Kolminaisuuden päivä","alternate_names":"1. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0060","description":"Pyhän Kolminaisuuden päivä on kristillinen juhlapäivä, jota vietetään ensimmäisenä sunnuntaina helluntain jälkeen. Sen vietto sai alkunsa Englannissa 1000-luvulla. Päivä on omistettu Pyhälle Kolminaisuudelle. Pyhän kolminaisuuden päivän liturginen väri on valkoinen."},{"date":"2025-06-21","name":"Juhannus","flag_day":1,"alternate_names":"Johannes Kastajan päivä; Suomen lipun päivä","url":"https:\/\/fi.wikipedia.org\/wiki\/Juhannus","description":"Juhannus on suomalainen nimi keskikesän juhlalle, jota vietetään kesäkuussa kesäpäivänseisauksen lähellä. Pohjoisessa juhannus on valon juhla, jolloin keskikesä on kauneimmillaan.\n\nSuomalaiseen juhannukseen kuuluvat kiinteästi juhannussauna, juhannuskokko, juhannustanssit ja muut juhlat. Suomessa juhannus on myös virallinen liputuspäivä, jolloin liputetaan koko juhannusyön ajan. Monet juhannuksen perinteistä juontavat juurensa vanhaan eurooppalaiseen valon ja hedelmällisyyden juhlaan kesäpäivänseisauksen aikana.\n\nSuomessa ja Ruotsissa juhannus on ollut tärkeä kansanomainen merkkipäivä. Juhannukseen on vanhastaan liittynyt erilaisia uskomuksia ja taikoja, joilla on pyritty varmistamaan tuleva sato ja naimaonni. Monet kristilliset kirkkokunnat viettävät juhannusta Johannes Kastajan muistopäivänä, mistä tulee nimi juhannus.\n\nJuhannus on virallinen liputuspäivä, Suomen lipun päivä. Muista liputuspäivistä poiketen silloin liputus alkaa jo aattoiltana kello 18 ja jatkuu yön yli yhtäjaksoisesti juhannuspäivän iltaan kello 21 saakka."},{"date":"2025-07-20","name":"Apostolien päivä","alternate_names":"6. sunnuntai helluntaista","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0065","description":"Apostolien päivää on vietetty Pietarin ja Paavalin marttyyrikuolemiensa muistoksi Keskiajalla, mutta nykyään Apostolien päivänä muistellaan kaikki apostoleja. Liturginen väri on punainen ja alttarikynttilöitä on neljä."},{"date":"2025-08-03","name":"Kirkastussunnuntai","alternate_names":"8. sunnuntai helluntaista; Kristuksen kirkastumisen päivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0067","description":"Kirkastussunnuntai on Suomen evankelis-luterilaisen kirkon kirkkovuodessa nimitys seitsemännelle kolminaisuudenpäivän jälkeiselle sunnuntaille eli kahdeksannelle sunnuntaille helluntaista. Päivää vietetään Kristuksen kirkastumisen muistoksi."},{"date":"2025-10-05","name":"Mikkelinpäivä","alternate_names":"Enkelien sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0091","description":"Mikkelinpäivä on alun perin arkkienkeli Mikaelin, mutta nykyisin päivä on omistettu kaikille enkeleille."},{"date":"2025-11-01","name":"Pyhäinpäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0092","description":"Pyhäinpäivä on kristillinen pyhimysten, marttyyrien ja vainajien muistopäivä\n\nNykyinen suomalainen pyhäinpäivä on yhdistelmä kahdesta varsinkin katolisen kirkon keskiajalta lähtien viettämästä juhlasta, jotka ovat kaikkien pyhien päivä 1. marraskuuta ja kaikkien uskovien vainajien muistopäivä 2. marraskuuta. Suomessa siitä on tullut yleinen vainajien muistopäivä. Silloin monet vievät läheisten haudalle esimerkiksi kynttilän tai kukkia kuolleiden muistoksi. Kotona voidaan myös sytyttää kynttilä läheisen muistoksi.\n\nVanhoista ajoista on Suomessa vietetty syksyllä sadonkorjuun päättymisen jälkeen kekriä. Koska se ajankohdaltaan sattui lähelle kristillistä pyhäinpäivää, se on myöhempinä aikoina usein samastettukin pyhäinpäivän kanssa, josta kansanomaisesti onkin käytetty myös nimitystä kekri."},{"date":"2025-11-23","name":"Tuomiosunnuntai","alternate_names":"Kristuksen kuninkuuden sunnuntai","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0087","description":"Tuomiosunnuntai kirkkovuoden viimeinen sunnuntai. Sen nimi vaihtelee eri kirkkokunnissa, Suomessa se on Ruotsin mallin mukaan 'tuomiosunnuntai'. Tuomiosunnuntain liturginen väri on vihreä.\n\nTuomiosunnuntain sanoma liittyy Kristuksen toiseen tulemukseen, nyt kuninkaana ja vanhurskaana tuomarina."},{"date":"2025-12-06","name":"Suomen itsenäisyyspäivä","flag_day":1,"age":108,"url":"https:\/\/fi.wikipedia.org\/wiki\/Suomen_itsen%C3%A4isyysp%C3%A4iv%C3%A4","description":"Suomen itsenäisyyspäivä on Suomen kansallispäivä, jota vietetään 6. joulukuuta 1917 tapahtuneen itsenäistymisen kunniaksi. Itsenäisen Suomea edelsi Suomen suuriruhtinaskunta, joka oli itsehallinnollinen osa Venäjän keisarikuntaa.\n\nJoulukuun 6. päivää on vietetty itsenäisyyspäivänä vuodesta 1919 lähtien. Asiasta päätti Valtioneuvosto, ja päivästä tuli vapaapäivä valtion virastoissa, kouluissa ja tuomioistuimissa. Vuonna 1929 säädettiin lailla yleiseksi palkalliseksi vapaapäiväksi. Vuonna 1937 säädettiin laki itsenäisyyspäivän viettämisestä yleisenä juhla- ja vapaapäivänä. Sen mukaan päivä itsenäisyyspäivän tuli olla palkallinen vapaapäivä, tai missä se ei ole mahdollista, on maksettava korotettua palkkaa kuten sunnuntaityöstä.\n\nItsenäisyyspäivä on myös virallinen liputuspäivä. Silloin liputus päättyy muista liputuspäivistä poikkeavasti klo 20."},{"date":"2025-12-25","name":"Joulupäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0009","description":"Joulua vietetään Jeesuksen syntymän muistoksi. Joulun vietto alkaa Suomessa yleensä jo aattoiltana, joulukuun 25. päivä on kuitenkin varsinainen joulupäivä.\n\nJoulun ajankohta on muinaisen roomalaisen kalenterin talvipäivänseisauksen päivämäärä. Suomen kielen sana joulu ja juhla ovat ruotsalaisia tai skandinaavisia lainasanoja. Sana joulu tulee alun perin ennen kristinuskoa vietetyn talvipäivänseisauksen juhlan muinaisgermaanisesta nimestä. Joulussa ovat yhdistyneet kristillinen juhla, muinainen roomalainen saturnalia-juhla sekä Euroopan pohjoisten kansojen maatalousvuoden päättäjäis- ja keskitalven juhla (yule), Suomessa vanha vuodenvaihteenjuhla kekri. Joulu on yleinen perhejuhla eri puolilla maailmaa."},{"date":"2025-12-26","name":"Tapaninpäivä","alternate_names":"2. joulupäivä; marttyyri Stefanoksen ja kaikkien marttyyrien muistopäivä","url":"http:\/\/evl.fi\/Evkirja.nsf\/ppFI?OpenPage&id=0010","description":"Tapaninpäivä eli toinen joulupäivä on joulunseudun kirkkopyhä, ensimmäisen marttyyrin Stefanoksen ja hänen myötään kaikkien marttyyrien muistopäivä. Tapaninpäivä on aina ollut myös hevosten ja hevosmiesten päivä.\n\nTapaninpäivän perinteisiin kuuluu tapaninajelu, mieluiten hevosella. Hevosia opetettiin juoksemaan ja ajeltiin kylillä hupailemassa. Iloiset rekiretket tehtiin joukolla ja joulun hiljaisen hartaan tunnelman jälkeen nuoriso ja vanhempikin väki huristeli innoissaan kylänraitteja. Myös tapaninkulkueita, laulajia, jouluämmiä ja -äijiä liikkui eri puolilla kyliä."}]